[{"title": "GM fires Indian engineer who helped expose VW emissions fraud", "content": "Hemanth Kappanna, whose research helped expose Volkswagen's conspiracy to lie about its diesel cars' emissions, was fired by US' General Motors as part of a \"strategic transformation\". His severance package consisted of two months' salary and a one-way ticket to India. Kappanna returned to Bengaluru as he could not find a job before his work visa's 60-day grace period expired.", "category": "business"}, {"title": "Nirav Modi denied bail for third time despite him offering ₹18 cr", "content": "A London court on Wednesday denied bail to Nirav Modi for the third time despite him offering ₹18 crore as security. Nirav's lawyer said her client should be granted bail because most of his funds are frozen and he has shown that he's no longer seeking residence abroad. The 48-year-old is facing extradition to India over the ₹14,000-crore PNB scam.", "category": "business"}, {"title": "McDonald's India settles 6-year-old dispute with Vikram Bakshi", "content": "McDonald's has purchased estranged India partner Vikram Bakshi's 50% stake in Connaught Plaza Restaurants (CPRL), settling a 6-year-old dispute. Launched in 1995 as a joint venture, CPRL operates 169 McDonald's outlets in north and east India. In 2017, the US fast-food company terminated CPRL's franchise agreement citing non-payment of royalties and asked suppliers to stop dealing with the latter.", "category": "business"}, {"title": "Trump lost $1 bn over a decade, avoided paying taxes for 8 yrs: NYT", "content": "US President Donald Trump's businesses, mainly casinos, hotels and apartment buildings, lost $1.17 billion from 1985 to 1994, according to The New York Times. Trump lost so much money that he was able to avoid paying income taxes for eight of the 10 years, the newspaper added. Trump reportedly posted losses of over $250 million in both 1990 and 1991.", "category": "business"}, {"title": "Reliance Industries loses ₹96,000 crore market value in four days", "content": "Shares of Mukesh Ambani-led Reliance Industries have fallen nearly 11% in the last four sessions, erasing about ₹96,000 crore in market value. With this fall in Reliance shares, Tata Consultancy Services has overtaken the company to become India's most valued firm with a market capitalisation of ₹8.14 lakh crore. Reliance's market cap stood at ₹7.96 lakh crore.", "category": "business"}, {"title": "Rajan among top contenders for Bank of England Governor: Bloomberg", "content": "Former RBI Governor Raghuram Rajan is \"moving up in the race\" to be the next Bank of England Governor, according to a Bloomberg survey of economists. The University of Chicago professor is now in second place, behind Andrew Bailey, CEO of the UK's Financial Conduct Authority. Canadian Mark Carney became the first foreign Governor of Bank of England in 2013.", "category": "business"}, {"title": "NR Jagdale, man behind India's first single-malt whisky, dies", "content": "Bengaluru-based Amrut Distilleries' MD and Chairman Neelakanta Rao Jagdale passed away on Thursday at the age of 66 after a brief illness. Amrut's Fusion Single Malt Whisky, India's first single-malt whisky, was ranked the third best in the world in 2010 by whisky expert Jim Murray. Jagdale was also known for his involvement in the promotion of swimming among youth.", "category": "business"}, {"title": "Billionaire Shanghvi to keep Suzlon stake despite falling value", "content": "Sun Pharma's billionaire Founder Dilip Shanghvi, who bought a 23% stake in Suzlon for ₹1,800 crore in 2015, said he intends to stay invested in the unprofitable wind-turbine maker. Shanghvi said policy hurdles were responsible for lower demand for Suzlon's wind turbines. The company's market value plunged to ₹3,300 crore on Wednesday from ₹10,900 crore when Shanghvi invested.", "category": "business"}, {"title": "Father not bidding for Jet: Goyal's daughter after UK man's claim", "content": "After British entrepreneur Jason Unsworth claimed he submitted a bid for Jet Airways with five others including Founder Naresh Goyal, his daughter Namrata called it \"completely misleading and mischievous\". \"I'm Goyal's daughter and this is to clarify that he's not part of any consortium,\" she tweeted. Goyal had said he hoped that a successful bidder will emerge by May 10.", "category": "business"}, {"title": "$40M worth bitcoins stolen from 4th largest crypto exchange", "content": "Cryptocurrency exchange Binance has revealed hackers stole over 7,000 bitcoins worth around $40 million in a single transaction on May 7. It said the affected cryptocurrency wallet contained 2% of total bitcoins that it holds, adding, \"All our other wallets are secure and unharmed.\" Binance is presently world's fourth-largest cryptocurrency exchange, as per coinmarketcap.com data for past 30 days.", "category": "business"}, {"title": "Apple may open its 1st India retail store in Mumbai: Report", "content": "Apple has reportedly zeroed in on several upscale locations in Mumbai to open its first retail store in the country. The iPhone maker reportedly plans to make a final decision in the next few weeks. Earlier, Apple was unable to open India retail stores as it didn't meet certain local sourcing norms set by the government, the report added.", "category": "business"}, {"title": "Huawei CFO to seek extradition stay citing Trump's comments", "content": "Huawei CFO Meng Wanzhou intends to seek a stay of extradition proceedings in part based on  \"intimidating and coercive\" statements by US President Donald Trump about the case, her lawyers said. The statements disqualify the US from pursuing the matter in Canada, they added. The 47-year-old is accused of conspiring to violate US sanctions on Iran.", "category": "business"}, {"title": "No choice or Tesla would die: CEO Musk on working 90 hours a week", "content": "Billionaire Elon Musk, responding to a Twitter user's query if he works around 80-90 hours per week, said, \"In recent years, hours were much higher...But no choice or Tesla would die.\" \"Don't recommend though...bad for health and happiness,\" the Tesla Co-founder and CEO further wrote. Musk had earlier said people can change the world by working 80 hours a week.", "category": "business"}, {"title": "Chinese trade officials coming to US to make a deal: Trump", "content": "US President Donald Trump has said Chinese trade officials, led by Vice-Premier Liu He, will come to Washington to \"make a deal\". \"We'll see but I'm very happy with...$100 billion a year in tariffs filling US coffers...not good for China!\" he added. The US recently announced tariffs on $200 billion Chinese imports would more than double on Friday.", "category": "business"}, {"title": "Abraaj Founder yet to pay ₹136 crore bail, stays in UK jail", "content": "A London court on Wednesday allowed private-equity firm Abraaj's Founder Arif Naqvi two more days to raise £15-million (₹136 crore) bail. Naqvi, who was granted bail last week, is still in jail as he hasn't paid the security bond. Naqvi was arrested in Britain last month and is awaiting potential extradition to US where he faces charges of defrauding investors.", "category": "business"}, {"title": "Zee denies rumours, says audit by Deloitte in progress", "content": "Zee Entertainment Enterprises has said audit of its financial statements by Deloitte was \"very much in progress\", refuting rumours about auditor concerns. The audited books will be considered for approval in the board meeting on May 27, it added. Promoters led by Subhash Chandra are currently looking to sell 50% of their stake in the company to reduce debt.", "category": "business"}, {"title": "RBI's credit registry will affect private credit bureaus: US", "content": "The US has objected to the Reserve Bank of India's (RBI) move to create a Public Credit Registry (PCR) on the grounds that it will be anti-competitive for private credit bureaus. The PCR, which is a repository of loan information of individuals and corporate borrowers, seeks to curb bad loans. Notably, US-based TransUnion and Equifax operate credit bureaus in India.", "category": "business"}, {"title": "RBI retracts circular asking banks to declare IL&FS exposure", "content": "The RBI on Wednesday withdrew its April 24 circular which mandated banks to disclose their exposure to IL&FS and its group entities in their notes to financial statements. RBI had also directed lenders to reveal provisions required to be made against it. This comes after the NCLAT last week allowed banks to declare defaulting loans of IL&FS as bad loans.", "category": "business"}, {"title": "MRPL to operate plant at 50% capacity due to water shortage", "content": "Mangalore Refinery and Petrochemicals (MRPL) has said it will operate its refinery at about 50% capacity from Thursday due to \"acute shortage\" of water in Netravati river in absence of summer showers. The refinery added it is maximising sewage water to sustain operations \"to an extent possible\". MRPL will meet all commitments for fuel supply despite the shutdown, it said.", "category": "business"}, {"title": "IndiGo in process of seeking approvals to fly to China", "content": "Budget carrier IndiGo on Wednesday said it is in the process of securing necessary approvals for entering China. \"With our existing fleet and the arrival of new A321 Neos, we... [can] serve China, Middle East and Southeast Asia,\" the Gurugram-based airline said. IndiGo has reportedly already received approval to fly to China's Chengdu and Guangzhou.", "category": "business"}, {"title": "ED probes Etihad investment in Jet Privilege", "content": "The ED is reportedly probing Etihad Airways' investment in Jet Airways' frequent-flyer programme, Jet Privilege. The agency is investigating whether Foreign Direct Investment (FDI) norms were violated when the Abu Dhabi-based carrier took a stake in the programme, reports said. Queries raised by the erstwhile FIPB to both the airlines immediately after the deal had gone unanswered, reports added.", "category": "business"}, {"title": "Amrapali projects' ownership may be given to Noida authorities: SC", "content": "The Supreme Court has said it may give ownership rights of all 15 residential properties of cash-strapped Amrapali Group to Noida and Greater Noida authorities. It said the authorities can then engage any builder to finish the stalled projects. \"We may throw you out from these properties and transfer it lock, stock and barrel,\" the court added.", "category": "business"}, {"title": "RCom resolution professional asks for 13-month exclusion", "content": "Anil Ambani's Reliance Communications (RCom) has, through the resolution professional, sought 13-month exclusion in its insolvency process. The professional sought exclusion from April 30, 2018 to May 30, 2019 as the initial proceedings were stayed by the NCLAT and Supreme Court. The IBC allows 270 days to complete resolution, which has already passed for RCom if the exclusion isn't granted.", "category": "business"}, {"title": "RoC prepares report on Jet's books to check fund diversion", "content": "The Registrar of Companies (RoC) has submitted the inspection report of cash-strapped Jet Airways' books to the Ministry of Corporate Affairs (MCA). The inspection was initiated under the Ministry's instruction to ascertain if there was any diversion of funds. Jet, which has a debt of over ₹8,000 crore, temporarily suspended its operations on April 17 due to lack of funds.", "category": "business"}, {"title": "DC eliminate SRH from IPL 2019, to face CSK in Qualifier 2", "content": "Delhi Capitals on Wednesday eliminated 2018 runners-up SunRisers Hyderabad from IPL 2019 after defeating them in the last over of the Eliminator. Delhi Capitals will now face Chennai Super Kings in the tournament's Qualifier 2 on Friday. The winner of the Qualifier 2 will lock horns with three-time champions Mumbai Indians in the final on Sunday.", "category": "sports"}, {"title": "Mishra 2nd player in IPL history to get out obstructing the field", "content": "DC's 36-year-old spinner Amit Mishra on Wednesday became the second player in IPL history to get out obstructing the field after Yusuf Pathan in 2013. Mishra started running across the pitch to survive run-out when SRH pacer Khaleel Ahmed's throw hit him on fourth delivery of the last over. DC required two runs off three balls before Mishra got out.", "category": "sports"}, {"title": "Police pushed me at IPL match: Activist with disability posts video", "content": "TMN Deepak, a professor and activist with disability, has tweeted a video, alleging that policemen pushed and insulted him when he went to watch the IPL match in Chennai on Tuesday. He claimed he was \"demeaned\" when he sought clarity on a designated parking spot for persons with disabilities. \"Should v not ask parking? R v not citizens,\" Deepak tweeted.", "category": "sports"}, {"title": "Hang on, let me do ritual: Manjrekar as Iyer tosses coin in hurry", "content": "During the coin toss ahead of IPL 2019 Eliminator today, commentator Sanjay Manjrekar stopped Delhi Capitals captain Shreyas Iyer after he hurriedly tossed the coin even before Manjrekar introduced both the captains. \"Hang on...let me do the ritual...Very eager to kick off,\" he later said. \"That doesn't count, right?\" Manjrekar then asked the referee before Iyer tossed the coin again.", "category": "sports"}, {"title": "Great lineup but sadly on paper only: Mallya on RCB finishing last", "content": "Fugitive businessman Vijay Mallya, former owner of Royal Challengers Bangalore, has said that the team has \"a great lineup but sadly on paper only\". \"Devastated with the wooden spoon,\" he further said referring to RCB finishing last on the IPL 2019 points table. RCB finished last on the table with five victories from 14 matches.", "category": "sports"}, {"title": "Shreyas Iyer attempts running catch near rope, throws ball for six", "content": "DC captain Shreyas Iyer attempted a catch near the boundary but threw the ball beyond the ropes for a six against SRH on Wednesday. The incident happened in SRH's 19th over when Vijay Shankar slammed Trent Boult towards wide long-off. Iyer caught the ball after covering some distance but lost his balance and failed to throw it back into play.", "category": "sports"}, {"title": "Iyer decides to withdraw run-out appeal, Pant convinces him not to", "content": "DC captain Shreyas Iyer decided to withdraw run-out appeal after SRH batsman Deepak Hooda fell down on the pitch after a collision with pacer Keemo Paul in the last over. However, wicketkeeper-batsman Rishabh Pant, who ran Hooda out at non-striker's end, intervened and convinced Iyer to not withdraw the appeal as Hooda was running in the middle of the pitch.", "category": "sports"}, {"title": "Pandya shouldn't be put under pressure: Kapil Dev on comparisons", "content": "India's 1983 World Cup-winning captain Kapil Dev has said all-rounder Hardik Pandya shouldn't be put under pressure. \"He's a young player and should be allowed to play his natural game. There should be no comparisons at this point,\" Dev added. He further said that India's pace attack is fantastic and English conditions will help them a lot in World Cup.", "category": "sports"}, {"title": "Liverpool manager calls team 'f***ing giants' after win vs Barça", "content": "After Liverpool overturned a three-goal first-leg deficit to beat Barcelona 4-3 on aggregate in Champions League semi-final, Liverpool manager Jürgen Klopp called his team \"f***ing giants\". \"These boys are f***ing mentality giants! It's unbelievable. It's unbelievable. Fine me. Fine me if you want but I'm not native so I don't have better words for it,\" he said.", "category": "sports"}, {"title": "Liverpool pull off greatest CL semi comeback to knock Barcelona out", "content": "Liverpool produced the greatest semi-final comeback in Champions League era by overturning a three-goal first-leg deficit to beat Barcelona 4-3 on aggregate to reach the final. Forward Divock Origi and midfielder Georginio Wijnaldum scored twice each for the home side. Liverpool are the first English side to reach back-to-back Champions League finals since Manchester United in 2008 and 2009.", "category": "sports"}, {"title": "Beckham banned from driving for 6 months for using phone at wheel", "content": "Ex-England football team captain David Beckham has been banned from driving for six months for using his mobile phone while driving his Bentley in London last November. The Bromley Magistrates' Court also imposed a fine of £750 on the 44-year-old. Beckham was seen by a member of the public looking at his lap and using the phone, the prosecutor said.", "category": "sports"}, {"title": "Why should there be labels? Mandhana on 'woman cricketer' tag", "content": "Indian women's cricket team vice-captain Smriti Mandhana has said that she \"no longer\" sees herself as a woman cricketer but simply as a cricketer. \"Why should there be labels when none are required,\" she added. \"It would get frustrating when my male counterparts were questioned about their game or performance whereas I was fielding questions on gender stereotypes,\" she stated.", "category": "sports"}, {"title": "Flintoff urges England to drop anyone and get Archer for World Cup", "content": "Ex-England all-rounder Andrew Flintoff has suggested England should call up all-rounder Jofra Archer to their World Cup squad at any cost. \"Who would I get rid of [to include Archer]? Anyone. He's brilliant,\" he said. \"I was watching him bowl...and found it so frustrating that a bloke can bowl so fast with what looks like so little effort,\" Flintoff added.", "category": "sports"}, {"title": "Tottenham post comeback win in 96th min, reach CL final for 1st time", "content": "After being 0-3 down on aggregate in Champions League semi-final second leg against Ajax, Tottenham midfielder Lucas Moura completed a second-half hat-trick in 96th minute (injury time) to help his team reach the final on away goals. Tottenham, who became the fifth English club to reach CL final, will play Liverpool in the summit clash in Madrid on June 1.", "category": "sports"}, {"title": "Mumbai Police share video of Liverpool goal to promote road safety", "content": "Mumbai Police today used reference of Liverpool defender Trent Alexander-Arnold's trickery in the semi-final, which helped his side score their fourth goal to knock Barcelona out of Champions League, to promote road safety. \"Be it the road to a final, or way back home...being distracted cost dear even to the mightiest. It can cost you dearly too,\" Mumbai Police wrote.", "category": "sports"}, {"title": "Selfish Afridi ruined many careers for his own good: Imran Farhat", "content": "Pakistani batsman Imran Farhat has said that former Pakistan captain Shahid Afridi is a \"selfish man\" who has ruined careers of other players. Farhat further urged the players who have been \"named and shamed\" in Afridi's book must speak up and tell the truth about him. \"He sure is talented enough to become a politician,\" Farhat further said.", "category": "sports"}, {"title": "Australia's 22-year-old fast bowler Jhye Richardson ruled out of WC", "content": "Cricket Australia on Wednesday announced that 22-year-old fast bowler Jhye Richardson has been withdrawn from their 15-member squad for the 2019 World Cup that begins on May 30. Richardson will miss the quadrennial tournament owing to a dislocated right shoulder. Fast bowler Kane Richardson has been named as replacement for Jhye, who had made his debut in January last year.", "category": "sports"}, {"title": "Riyan Parag is an absolute potential superstar: Dean Jones", "content": "Talking about Rajasthan Royals' 17-year-old all-rounder, Australian commentator Dean Jones said that he is an absolute potential superstar. \"I reckon he plays amazing shots to all parts of the ground. Just like AB de Villiers he gives himself access to the ball to hit it 360 degrees,\" he added. Parag is the youngest cricketer to score a fifty in IPL.", "category": "sports"}, {"title": "Velocity defeat Trailblazers despite losing 5 wickets for 0 runs", "content": "Mithali Raj-led Velocity defeated Smriti Mandhana-led Trailblazers by three wickets despite going from 111/2 to 111/7 during their run chase of 113 runs in the Women's T20 Challenge's second match. Trailblazers spinner Deepti Sharma registered bowling figures of 4-0-14-4, while Velocity's Danielle Wyatt top-scored with 46 runs off 35 balls. Velocity will next face Supernovas on May 9.", "category": "sports"}, {"title": "My inspiration, friend, brother, legend: Hardik on pic with Dhoni", "content": "MI all-rounder Hardik Pandya took to Twitter on Wednesday to share a picture of himself shaking hands with CSK captain MS Dhoni following the IPL 2019 Qualifier 1, which MI won by six wickets. \"My inspiration, my friend, my brother, my legend,\" Hardik captioned the picture. MI have now won four consecutive matches against CSK.", "category": "sports"}, {"title": "I will execute Ashwin's tips in WC: KXIP's 18-yr-old Mujeeb", "content": "KXIP's 18-year-old spinner Mujeeb Ur Rahman said that he would use the \"useful tips\" given to him by team's captain Ravichandran Ashwin in Afghanistan's World Cup campaign. \"I've learnt a lot, having spent quality time with Ashwin,\" he added. \"[In IPL] you get chance to bowl to batsmen who will be in the World Cup, it helps,\" he further stated.", "category": "sports"}, {"title": "Smith hits 89*, Warner 0 as Australia lose WC warm-up match", "content": "Australia batsmen Steve Smith and David Warner, who recently returned to the national side after serving their bans over ball-tampering, scored 89* and 0 respectively against New Zealand XI in a warm-up match on Wednesday. Will Young's century helped the Kiwis chase down the 278-run target in 47.2 overs. Returning from injury, Mitchell Starc, registered bowling figures of 5-0-14-2.", "category": "sports"}, {"title": "Small margins are frustrating: SRH captain on last over loss", "content": "After DC beat SRH by two wickets with one ball remaining in IPL 2019 Eliminator, SRH captain Kane Williamson said, \"It's a bit frustrating when the margin is small.\" Last season the team was on the \"right side\" of such close encounters, Williamson added. \"Some learning for the next year...but disappointing to depart from the competition,\" the 28-year-old stated.", "category": "sports"}, {"title": "Federer plays clay match after 3 yrs, wins in straight sets", "content": "Twenty-time Grand Slam champion Roger Federer returned to clay court after three years and defeated France's Richard Gasquet 6-2, 6-3 at Madrid Open on Tuesday. Federer, who last played on clay against Dominic Thiem at 2016 Rome Masters, took 53 minutes to beat Gasquet. \"I would have...regrets not being on...clay in 2019,\" the world number three said after the win.", "category": "sports"}, {"title": "OnePlus 7 Pro set to launch with Android Q beta", "content": "OnePlus has announced that OnePlus 6/6T users are eligible to download the latest Android Q beta release starting today while it will be available for OnePlus 7 Pro on May 14. Notably, Android Q Beta will allow users to experience the latest technologies, including the new gesture-based navigation, Dark Theme and privacy enhancements which contribute to a burden-less experience.", "category": "technology"}, {"title": "OnePlus to host ‘Experience Pop-Up’ event in Delhi on May 17", "content": "OnePlus will be hosting one-of-its-kind 'OnePlus Experience Pop-Up' event on May 17 in Delhi, wherein users will get to experience the OnePlus 7 Pro. Early bird visitors will stand a chance to receive exclusive goodies including OnePlus Type-C Bullets, back cases, tote bags and 'Never Settle' T-shirt. Similar events will be held in 7 cities across India as well.", "category": "technology"}, {"title": "Ending conference in 2 hrs over Barca vs Liverpool match: Google CEO", "content": "Addressing Google I/O 2019 keynote in California on Tuesday, Google CEO Sundar Pichai said, \"We're going to keep the keynote under two hours.\" \"It's especially because the Barcelona kicks off against Liverpool at noon...It should be an amazing game,\" he added. Special Augmented Reality search results, updated Google Assistant and one-tap access to privacy settings were unveiled at the keynote.", "category": "technology"}, {"title": "CES re-awards prize to sex toy which it called 'immoral'", "content": "The world's biggest tech event CES, held in Las Vegas, has re-awarded a Robotics Innovation Award to a \"female-focused\" sex toy developed by startup Lora DiCarlo. CES withdrew the award saying the product was \"immoral, obscene, indecent or profane\", following which Founder Lora Haddock accused the organisers of sexism and bias. \"We did not handle this award properly,\" organisers said.", "category": "technology"}, {"title": "Privacy can't be a luxury, must be available to all: Google CEO", "content": "Google CEO Sundar Pichai, in a New York Times article, wrote, \"Privacy cannot be a luxury good offered only to people who can afford to buy premium products and services.\" \"Privacy must be equally available to everyone in the world,\" Pichai said, adding, \"We're also working hard to challenge the assumption that products need more data to be more helpful.\"", "category": "technology"}, {"title": "Singapore passes 'fake news' law, offenders may face 10-yr jail", "content": "Singapore's Parliament on Wednesday passed a law to curb the spread of fake news under which offenders may face up to 10-year jail or fines of up to S$1 million (over ₹5.12 crore). The law empowers the government to direct social media platforms such as Facebook and Twitter to carry corrections or remove content it considers to be fake news.", "category": "technology"}, {"title": "Google to add Incognito mode to Search and Maps for privacy", "content": "Google CEO Sundar Pichai on Tuesday announced its Chrome browser-famed Incognito mode would be expanded to Maps and Search this year. However, Incognito mode for Maps would not disable location tracking but that activity will not be linked to the user's profile and will not affect future searches. Google recently announced support for auto-deleting location history.", "category": "technology"}, {"title": "Google to add option to let users pay for apps with cash", "content": "Google, in its 2019 I/O developers conference, announced it's launching \"pending transactions\" feature, which offers users the option to receive a code to pay for apps with methods like cash at nearby convenience stores. Users will then receive their purchase and email with proof of payment. Google said it's in the process of rolling out support for UPI in India.", "category": "technology"}, {"title": "WhatsApp to end support for all Windows phones after December 31", "content": "Facebook-owned messaging platform WhatsApp has announced it is ending support for all versions of Windows Phone operating system after December 31. Facebook had previously ended support for its main app, Messenger and Instagram on April 30 for Windows phones. The move had come over Microsoft's announcement to end support for all versions of its Windows Phone in December 2019.", "category": "technology"}, {"title": "Google Lens now lets people split bills using phone camera", "content": "Google has added a new feature to its image recognition software Google Lens to split bills by pointing the phone's camera at the receipts. The feature, which uses an in-camera calculator, also lets users calculate tips. Further, Google has added another feature to Lens that automatically highlights the most popular dishes at a restaurant when pointed at its menu.", "category": "technology"}, {"title": "FB hires PayPal employees, may test its crypto in India: Report", "content": "Facebook's blockchain unit headed by former PayPal President David Marcus now consists of 50 employees, several of whom previously worked at PayPal, Bloomberg reported. The unit, set up last year, is developing a cryptocurrency 'stablecoin', to be tested in India at first, the report added. The product may eventually allow users to transfer money via WhatsApp Pay.", "category": "technology"}, {"title": "$40M worth bitcoins stolen from 4th largest crypto exchange", "content": "Cryptocurrency exchange Binance has revealed hackers stole over 7,000 bitcoins worth around $40 million in a single transaction on May 7. It said the affected cryptocurrency wallet contained 2% of total bitcoins that it holds, adding, \"All our other wallets are secure and unharmed.\" Binance is presently world's fourth-largest cryptocurrency exchange, as per coinmarketcap.com data for past 30 days.", "category": "technology"}, {"title": "Huawei CFO to seek extradition stay citing Trump's comments", "content": "Huawei CFO Meng Wanzhou intends to seek a stay of extradition proceedings in part based on  \"intimidating and coercive\" statements by US President Donald Trump about the case, her lawyers said. The statements disqualify the US from pursuing the matter in Canada, they added. The 47-year-old is accused of conspiring to violate US sanctions on Iran.", "category": "technology"}, {"title": "Smart suitcase that warns blind users before collision made", "content": "International researchers have made a smart suitcase that warns blind users before a collision, aimed at helping people with visual disabilities safely navigate airport terminals independently. It sounds an alarm beginning five seconds before collision and issues a stop sound when collision is imminent. They also modified an app that gives audio navigation directions to users for airport use.", "category": "technology"}, {"title": "PUBG fails China approval, Tencent launches 'patriotic' alternative", "content": "Chinese gaming giant Tencent has ended the test version of PUBG in China after it failed to get approved. Tencent has launched a \"patriotic\" PUBG alternative, an anti-terrorism-themed game titled 'Heping Jingying' (Elite Force for Peace). PUBG Mobile, licensed from South Korean developer Krafton, failed to get China approval likely due to politics over its South Korean IP, reports said.", "category": "technology"}, {"title": "Apple features Warren Buffett in its 1st game since 2008", "content": "Apple has featured the world's fourth-richest person, Berkshire Hathaway CEO Warren Buffett, in its first game since 2008. Apple released the 'Warren Buffett's Paper Wizard' game after CEO Tim Cook had recently jokingly suggested it in a short film in Berkshire Hathaway's annual meeting. Notably, Warren Buffett had worked as a paper delivery boy when he was 13 years old.", "category": "technology"}, {"title": "Google Assistant drops need to say 'Hey Google' repeatedly", "content": "Google, in its 2019 I/O developers conference, announced its AI-based Assistant is now up to 10 times faster, adding it no longer requires users to repeatedly say 'Hey Google' to perform multiple tasks. Google has also added new Assistant shortcuts for health, finance, food and ridesharing. Users will now be able to directly order food or book cabs via Assistant.", "category": "technology"}, {"title": "Apple may open its 1st India retail store in Mumbai: Report", "content": "Apple has reportedly zeroed in on several upscale locations in Mumbai to open its first retail store in the country. The iPhone maker reportedly plans to make a final decision in the next few weeks. Earlier, Apple was unable to open India retail stores as it didn't meet certain local sourcing norms set by the government, the report added.", "category": "technology"}, {"title": "Mumbai's Wadhwani AI to receive $2 million Google grant", "content": "Mumbai-based Wadhwani Institute for AI is among 20 organisations that will share $25-million grants from Google.org under Google AI Impact Challenge. Wadhwani AI will receive $2 million to create technologies that will help reduce crop losses in cotton farming via integrated pest management. Grantees will go to San Francisco next week for a six-month programme run by Google Developers Launchpad.", "category": "technology"}, {"title": "Alibaba-backed Chinese AI startup Megvii raises $750 million", "content": "Alibaba-backed Chinese AI startup Megvii, commonly known for its facial recognition brand Face++, has raised $750 million in its latest funding round. The funding raises Megvii's valuation to over $4 billion as it prepares for its IPO in Hong Kong planned for later this year, Reuters reported. Bank of China Group Investment reportedly led the funding round with $200 million.", "category": "technology"}, {"title": "Instagram to roll out in-app option to appeal post takedowns", "content": "Instagram is going to start rolling out a new in-app option to let users request a review of taken-down content, as per a media briefing in the US. To ensure thorough inspection, appeals will be sent to a different reviewer than the one who made the original decision. Instagram will restore posts if it realises a mistake, the platform said.", "category": "technology"}, {"title": "Indian students' team comes 2nd at Microsoft competition", "content": "Manav Rachna Institute of Research and Studies, Faridabad students' team placed second at Microsoft's 2019 Imagine Cup World Championship. It created a smart automated anti-pollution and drug delivery mask named Caeli, specifically designed for asthmatic and chronic respiratory patients. A US team that created cloud-powered, non-invasive blood glucose monitoring method for diabetic patients, won.", "category": "technology"}, {"title": "Unsure on Galaxy Fold shipping, will cancel US pre-orders: Samsung", "content": "Samsung on Tuesday said it cannot confirm the shipping dates for its $1,980 foldable device Galaxy Fold. It further apologised to US customers who had pre-booked the device, adding that their orders will automatically be cancelled if the device doesn't ship by May 31, unless informed otherwise. Samsung had delayed Fold after several issues with its screen were reported.", "category": "technology"}, {"title": "Facebook may pick London as WhatsApp Pay base amid India test", "content": "Facebook plans to use London to drive the global expansion of WhatsApp's mobile payments service, a company spokesperson confirmed. WhatsApp dispatched engineers to Britain late last year to recruit about 100 people in London and Dublin to support its payments initiative, the spokesperson added. Facebook started its test for the service in India over a year ago.", "category": "technology"}, {"title": "Man approaches Swara and records video, says 'Aayega Modi hi'", "content": "Actress Swara Bhasker has shared on Twitter that a man had approached her for a selfie at an airport and \"sneakily\" shot a video. \"Ma'am, aayega Modi hi,\" the man can be heard saying in the video. \"I don't discriminate people who want selfies based on their politics...Tacky & underhand tactics,\" Swara wrote on Twitter.", "category": "entertainment"}, {"title": "Road journey became a nightmare: TV actress on escaping Cyclone Fani", "content": "TV actress Rachana Parulkar, while narrating her experience of escaping Cyclone Fani during a family trip, said, \"Our entire road journey became a nightmare.\" Rachana, who was travelling to Cherrapunjee from Guwahati, added, \"We witnessed four landslides on the way...It took us almost five hours to get to a safer place.\" \"It was a near-fatal encounter,\" Rachana further said.", "category": "entertainment"}, {"title": "Akshay Kumar thanks Kiren Rijiju for support in citizenship row", "content": "Actor Akshay Kumar has thanked Union Minister Kiren Rijiju for coming out in his support following a controversy over his citizenship. After Akshay tweeted that he has never denied holding a Canadian passport, Rijiju had said Akshay's patriotism towards India is beyond any doubt. \"Please be assured, my commitment to...Indian armed forces would remain steady, no matter what,\" Akshay responded.", "category": "entertainment"}, {"title": "If Kangana is not trolled, she won't speak against Super 30: Rangoli", "content": "Rangoli Chandel, while speaking about her sister Kangana Ranaut being targetted for the clash between her film 'Mental Hai Kya' and Hrithik Roshan's 'Super 30', said, \"If Kangana isn't trolled, she won't speak against Super 30.\" She earlier accused Hrithik of orchestrating tweets against Kangana. \"Just because [Hrithik] can't say anything to Ekta, he made Kangana...punching bag,\" Rangoli wrote.", "category": "entertainment"}, {"title": "Hrithik making Kangana punching bag: Rangoli on clash of their films", "content": "Talking about her sister Kangana Ranaut's 'Mental Hai Kya' clashing with Hrithik Roshan's 'Super 30', Rangoli Chandel said that Hrithik is creating bad publicity for Kangana. She added that release date of 'Mental Hai Kya' was decided by Ekta Kapoor and \"just because [Hrithik] can't say anything to Ekta\", he made Kangana a \"punching bag\".", "category": "entertainment"}, {"title": "My real name Alia, Salman told to change it due to Alia Bhatt: Kiara", "content": "Actress Kiara Advani, during her appearance on 'Feet Up with the Stars' season 2, revealed Alia is her first name. Kiara added, \"Salman suggested me to change it because of Alia Bhatt because there can't be two actresses with...same name in Bollywood.\" \"Kiara is the name...I chose. Now even my parents have started to call me Kiara,\" she said.", "category": "entertainment"}, {"title": "People thought I got pregnant with Ananya before marriage: Bhavana", "content": "Actress Ananya Panday's mother Bhavana Pandey, while revealing that Ananya is a \"honeymoon baby\", said, \"People were actually calculating if I conceived her before or after marriage.\" \"She has been with us from our first anniversary,\" she added. Bhavana got married to actor Chunky Panday in January 1998 and Ananya was born in October in the same year.", "category": "entertainment"}, {"title": "Hrithik postpones Super 30 after Kangana’s sister’s tweets on him", "content": "Hrithik Roshan has postponed release date of 'Super 30', which was scheduled for July 26 with Kangana Ranaut's 'Mental Hai Kya'. Hrithik said he did so to save himself from personal trauma and toxic mental violence. Earlier, Kangana's sister claimed on Twitter that Hrithik created bad publicity for Kangana and made her a \"punching bag\" over clash of their films.", "category": "entertainment"}, {"title": "Weird that dusky actresses are called sexy, not beautiful: Esha", "content": "Actress Esha Gupta has said she finds it weird when actresses with a slightly darker complexion are called 'sexy' and not 'beautiful'. She added, \"I...get irritated when people associate beautiful women with fairness. Why can't a brown-skinned woman be beautiful?\" \"Why not dark and lovely, why only fair and lovely,\" Esha further said.", "category": "entertainment"}, {"title": "Trying to merge healing & work: Irrfan on acting post cancer", "content": "In a note addressed to the media, Irrfan Khan opened up about returning to work after undergoing treatment for cancer and wrote, \"Last few months have been...a road to recovery.\" \"I'm...taking baby steps to merge my healing with work and trying to experiment the amalgamation of both,\" he added. Irrfan further thanked the media for their support throughout his journey.", "category": "entertainment"}, {"title": "Put on weight post wedding, have dark circles & it's okay: Sonam", "content": "While speaking about the pressure women face, actress Sonam Kapoor said, \"In India, there's so much pressure on girls...Whether it's about who you're getting married to...[or] why is your skin looking like that.\" \"After my wedding, I've put on weight, my skin goes bad, I've really bad dark circles and I want all...girls to know that it's okay,\" she added.", "category": "entertainment"}, {"title": "Nawazuddin to feature in Housefull 4 song as exorcist: Reports", "content": "Actor Nawazuddin Siddiqui will reportedly be seen portraying the role of an exorcist in a song in the upcoming fourth instalment of the 'Housefull' film franchise, starring Akshay Kumar. The whole cast of the film will feature in the song with Nawazuddin, as per reports. The film will also see Kriti Sanon, Riteish Deshmukh, and Kriti Kharbanda in lead roles.", "category": "entertainment"}, {"title": "Ayushmann to play gay man in Shubh Mangal Saavdhan 2: Report", "content": "Ayushmann Khurrana will play the role of a gay man in the upcoming sequel to the 2017 film 'Shubh Mangal Saavdhan', as per reports. The film, which is reportedly titled 'Shubh Mangal Zyada Saavdhan', is about a father coming to terms with his son's sexuality. Scheduled to release next year, casting for the film is currently underway, reports further suggested.", "category": "entertainment"}, {"title": "I was bullied & called hunchback in school as I'm tall: Ananya", "content": "Ananya Panday revealed she was bullied in school and called 'hunchback' because she had to bend down to hear people talk as she was very tall. \"In school, I'd always be uncomfortable because my skirt would expose my thin, chicken legs,\" she added. \"This is the reason trolls don't affect me, as I've been bullied in school,\" Ananya further said.", "category": "entertainment"}, {"title": "It took 1,500 hrs to create Priyanka Chopra's Met Gala gown", "content": "Luxury brand Dior, which designed Priyanka Chopra's 2019 Met Gala gown, revealed a team of 10 workers worked on the gown for around 1,500 hours. The couture gown, featuring embroideries of hand-cut feathers and silver strass, was custom made by Dior's creative director Maria Grazia Chiuri. The Met Gala is an annual fundraising event held in New York.", "category": "entertainment"}, {"title": "Complaint against Sunny for disrespecting Sikh holy scarf", "content": "A Sikh body approached the Akal Takht to lodge a complaint against actor and BJP candidate from Gurdaspur Sunny Deol for allegedly dishonouring siropa (Sikh holy scarf) during a political rally. Earlier, a picture went viral where a siropa and a photograph of Lord Shiva were seen near Sunny's feet. Congress demanded an FIR against Sunny for hurting Hindu sentiments.", "category": "entertainment"}, {"title": "It started with transition from pizza to salad: Sara on losing weight", "content": "Opening up about her weight loss journey, actress Sara Ali Khan said, \"The transition from pizza to salad and from lethargy to cardio is how I kickstarted my fitness journey.\" \"[I]t all started in New York. I weighed 96kg,\" the actress added. Sara further said she works out almost every day for an hour and a half to stay healthy.", "category": "entertainment"}, {"title": "Avengers sank Titanic: Titanic maker as Endgame beats revenue record", "content": "The director of 'Titanic' James Cameron congratulated the makers of 'Avengers: Endgame' after the film beat 'Titanic' to become the second most successful film at the global box office. \"[A]n iceberg sank the real Titanic. It took the Avengers to sink my Titanic,\" Cameron tweeted. The filmmaker shared an image of the Titanic sinking as it hit the Avengers logo.", "category": "entertainment"}, {"title": "Baseless: Soni on rumours of daughter Alia marrying Ranbir", "content": "Actress Soni Razdan has denied reports that suggest her daughter Alia Bhatt will be tying the knot with actor Ranbir Kapoor in Lake Como, Italy. \"It is a totally baseless rumour!\" the actress said. Reports had earlier suggested that Alia and Ranbir, who are on a vacation in Lake Como, were also set to secretly get married there.", "category": "entertainment"}, {"title": "Paresh to feature in Varun's 'Coolie No. 1' remake: Reports", "content": "Paresh Rawal has reportedly joined the cast of the upcoming adaptation of the 1995 film 'Coolie No. 1', which will see Varun Dhawan and Sara Ali Khan in lead roles. Paresh will be essaying late actor Kader Khan's role from the original film and will play Sara's father, as per reports. The film is slated to release in May 2020.", "category": "entertainment"}, {"title": "Swara Bhasker campaigns for AAP candidate Atishi in Delhi", "content": "Swara Bhasker on Tuesday participated in a road show for Atishi, AAP's East Delhi candidate for the Lok Sabha elections. \"You've inspired us Atishi with your stellar work...Hope we get to hear ur voice ring loud and true in Parliament,\" Swara tweeted after the road show. Actress Gul Panag and Gujarat MLA Jignesh Mevani also campaigned for Atishi in Delhi.", "category": "entertainment"}, {"title": "Ranveer would've been perfect fit for Met Gala 2019: Deepika", "content": "Actress Deepika Padukone, who attended the 2019 Met Gala on Tuesday, said that she feels her husband Ranveer Singh would have been a \"perfect fit\" for this year's gala. \"He has this crazy sense of dressing...I think he'd do 100% justice to the theme,\" the actress added. The theme of this year's Met Gala was 'Camp: Notes On Fashion'.", "category": "entertainment"}, {"title": "Karan Oberoi sent to 14-day judicial custody in rape case", "content": "TV actor Karan Oberoi has been sent to 14-day judicial custody by an Andheri Court, after being accused of rape and blackmail by a female astrologer. He was arrested on May 6 following an FIR, stating that he not only raped her and filmed the act but also demanded money. She alleged they met through a dating app in 2016.", "category": "entertainment"}]