[{"title": "microsoft/Terminal", "language": "C++", "content": "Welcome! This repository contains the source code for:\n\nWindows Terminal\nThe Windows console host (conhost.exe)\nComponents shared between the two projects\nColorTool\nSample projects that show how to consume the Windows Console APIs\n\nBuild Status\n\n\n\nProject\nBuild Status\n\n\n\n\nTerminal\n\n\n\nColorTool\n\n\n\n\nTerminal & Console Overview\nPlease take a few minutes to review the overview below before diving into the code:\nWindows Terminal\nWindows Terminal is a new, modern, feature-rich, productive terminal application for command-line users. It includes many of the features most frequently requested by the Windows command-line community including support for tabs, rich text, globalization, configurability, theming & styling, and more.\nThe Terminal will also need to meet our goals and measures to ensure it remains fast, and efficient, and doesn't consume vast amounts of memory or power.\nThe Windows console host\nThe Windows console host, conhost.exe, is Windows' original command-line user experience. It implements Windows' command-line infrastructure, and is responsible for hosting the Windows Console API, input engine, rendering engine, and user preferences. The console host code in this repository is the actual source from which the conhost.exe in Windows itself is built.\nConsole's primary goal is to remain backwards-compatible with existing console subsystem applications.\nSince assuming ownership of the Windows command-line in 2014, the team has added several new features to the Console, including window transparency, line-based selection, support for ANSI / Virtual Terminal sequences, 24-bit color, a Pseudoconsole (\"ConPTY\"), and more.\nHowever, because the Console's primary goal is to maintain backward compatibility, we've been unable to add many of the features the community has been asking for, and which we've been wanting to add for the last several years--like tabs!\nThese limitations led us to create the new Windows Terminal.\nShared Components\nWhile overhauling the Console, we've modernized its codebase considerably. We've cleanly separated logical entities into modules and classes, introduced some key extensibility points, replaced several old, home-grown collections and containers with safer, more efficient STL containers, and made the code simpler and safer by using Microsoft's WIL header library.\nThis overhaul work resulted in the creation of several key components that would be useful for any terminal implementation on Windows, including a new DirectWrite-based text layout and rendering engine, a text buffer capable of storing both UTF-16 and UTF-8, and a VT parser/emitter.\nBuilding a new terminal\nWhen we started building the new terminal application, we explored and evaluated several approaches and technology stacks. We ultimately decided that our goals would be best met by sticking with C++ and sharing the aforementioned modernized components, placing them atop the modern Windows application platform and UI framework.\nFurther, we realized that this would allow us to build the terminal's renderer and input stack as a reusable Windows UI control that others can incorporate into their applications.\nFAQ\nWhere can I download Windows Terminal?\nThere are no binaries to download quite yet.\nThe Windows Terminal is in the very early alpha stage, and not ready for the general public quite yet. If you want to jump in early, you can try building it yourself from source.\nOtherwise, you'll need to wait until Mid-June for an official preview build to drop.\nI built and ran the new Terminal, but it looks just like the old console! What gives?\nFirstly, make sure you're building & deploying CascadiaPackage in Visual Studio, NOT Host.EXE. OpenConsole.exe is just conhost.exe, the same old console you know and love. opencon.cmd will launch openconsole.exe, and unfortunately, openterm.cmd is currently broken.\nSecondly, try pressing Ctrl+t. The tabs are hidden when you only have one tab by default. In the future, the UI will be dramatically different, but for now, the defaults are supposed to look like the console defaults.\nI tried running WindowsTerminal.exe and it crashes!\n\nDon't try to run it unpackaged. Make sure to build & deploy CascadiaPackage from Visual Studio, and run the Windows Terminal (Preview) app.\nMake sure you're on the right version of Windows. You'll need to be on Insider's builds, or wait for the 1903 release, as the Windows Terminal REQUIRES features from the latest Windows release.\n\nGetting Started\nPrerequisites\n\nYou must be running Windows 1903 (build >= 10.0.18362.0) or above in order to run Windows Terminal\nYou must have the 1903 SDK (build 10.0.18362.0) installed\nYou will need at least VS 2017 installed\nYou will need to install both the following packages in VS (\"Workloads\" tab in Visual Studio Installer) :\n\n\"Desktop Development with C++\"\n\"Universal Windows Platform Development\"\nIf you're running VS2019, you'll also need to install the \"v141 Toolset\" and \"Visual C++ ATL for x86 and x64\"\n\n\nYou will also need to enable Developer Mode in the Settings app to enable installing the Terminal app for running locally.\n\nContributing\nWe are excited to work alongside you, our amazing community, to build and enhance Windows Terminal!\nWe ask that before you start work on a feature that you would like to contribute, please file an issue describing your proposed change: We will be happy to work with you to figure out the best approach, provide guidance and mentorship throughout feature development, and help avoid any wasted or duplicate effort.\n\n👉 Remember! Your contributions may be incorporated into future versions of Windows! Because of this, all pull requests will be subject to the same level of scrutiny for quality, coding standards, performance, globalization, accessibility, and compatibility as those of our internal contributors.\n\n\n⚠ Note: The Command-Line Team is actively working out of this repository and will be periodically re-structuring the code to make it easier to comprehend, navigate, build, test, and contribute to, so DO expect significant changes to code layout on a regular basis.\n\nCommunicating with the Team\nThe easiest way to communicate with the team is via GitHub issues. Please file new issues, feature requests and suggestions, but DO search for similar open/closed pre-existing issues before you do.\nPlease help us keep this repository clean, inclusive, and fun! We will not tolerate any abusive, rude, disrespectful or inappropriate behavior. Read our Code of Conduct for more details.\nIf you would like to ask a question that you feel doesn't warrant an issue (yet), please reach out to us via Twitter:\n\n\nRich Turner, Program Manager: @richturn_ms\n\n\nDustin Howett, Engineering Lead: @dhowett\n\n\nMichael Niksa, Senior Developer: @michaelniksa\n\n\nKayla Cinnamon, Program Manager (especially for UX issues): @cinnamon_msft\n\n\nDeveloper Guidance\nBuilding the Code\nThis repository uses git submodules for some of its dependencies. To make sure submodules are restored or updated, be sure to run the following prior to building:\ngit submodule update --init --recursive\nOpenConsole.sln may be built from within Visual Studio or from the command-line using MSBuild. To build from the command line:\nnuget restore OpenConsole.sln\nmsbuild OpenConsole.sln\nWe've provided a set of convenience scripts as well as README in the /tools directory to help automate the process of building and running tests.\nCoding Guidance\nPlease review these brief docs below relating to our coding standards etc.\n\n👉 If you find something missing from these docs, feel free to contribute to any of our documentation files anywhere in the repository (or make some new ones!)\n\nThis is a work in progress as we learn what we'll need to provide people in order to be effective contributors to our project.\n\nCoding Style\nCode Organization\nExceptions in our legacy codebase\nHelpful smart pointers and macros for interfacing with Windows in WIL\n\nCode of Conduct\nThis project has adopted the Microsoft Open Source Code of Conduct.\nFor more information see the Code of Conduct FAQ or contact opencode@microsoft.com with any additional questions or comments.\n"}, {"title": "jackfrued/Python-100-Days", "language": "HTML", "content": "Python - 100天从新手到大师\n\n作者：骆昊\n\nPython应用领域和就业形势分析\n简单的说，Python是一个“优雅”、“明确”、“简单”的编程语言。\n\n学习曲线低，非专业人士也能上手\n开源系统，拥有强大的生态圈\n解释型语言，完美的平台可移植性\n支持面向对象和函数式编程\n能够通过调用C/C++代码扩展功能\n代码规范程度高，可读性强\n\n目前几个比较流行的领域，Python都有用武之地。\n\n云基础设施 - Python / Java / Go\nDevOps - Python / Shell / Ruby / Go\n网络爬虫 - Python / PHP / C++\n数据分析挖掘 - Python / R / Scala / Matlab\n机器学习 - Python / R / Java / Lisp\n\n作为一名Python开发者，主要的就业领域包括：\n\nPython服务器后台开发 / 游戏服务器开发 / 数据接口开发工程师\nPython自动化运维工程师\nPython数据分析 / 数据可视化 / 大数据工程师\nPython爬虫工程师\nPython聊天机器人开发 / 图像识别和视觉算法 / 深度学习工程师\n\n下图显示了主要城市Python招聘需求量及薪资待遇排行榜（截止到2018年5月）。\n\n\n\n给初学者的几个建议：\n\nMake English as your working language.\nPractice makes perfect.\nAll experience comes from mistakes.\nDon't be one of the leeches.\nEither stand out or kicked out.\n\nDay01~15 - Python语言基础\nDay01 - 初识Python\n\nPython简介 - Python的历史 / Python的优缺点 / Python的应用领域\n搭建编程环境 - Windows环境 / Linux环境 / MacOS环境\n从终端运行Python程序 - DOS命令 / Hello, world / print函数 / 运行程序\n使用IDLE - 交互式环境(REPL) / 编写多行代码 / 运行程序 / 退出IDLE\n注释 - 注释的作用 / 单行注释 / 多行注释\n\nDay02 - 语言元素\n\n程序和进制 - 指令和程序 / 冯诺依曼机 / 二进制和十进制 / 八进制和十六进制\n变量和类型 - 变量的命名 / 变量的使用 / input函数 / 检查变量类型 / 类型转换\n数字和字符串 - 整数 / 浮点数 / 复数 / 字符串 / 字符串基本操作 / 字符编码\n运算符 - 数学运算符 / 赋值运算符 / 比较运算符 / 逻辑运算符 / 身份运算符 / 运算符的优先级\n应用案例 - 华氏温度转换成摄氏温度 / 输入圆的半径计算周长和面积 / 输入年份判断是否是闰年\n\nDay03 - 分支结构\n\n分支结构的应用场景 - 条件 / 缩进 / 代码块 / 流程图\nif语句 - 简单的if / if-else结构 / if-elif-else结构 / 嵌套的if\n应用案例 - 用户身份验证 / 英制单位与公制单位互换 / 掷骰子决定做什么 / 百分制成绩转等级制 / 分段函数求值 / 输入三条边的长度如果能构成三角形就计算周长和面积\n\nDay04 - 循环结构\n\n循环结构的应用场景 - 条件 / 缩进 / 代码块 / 流程图\nwhile循环 - 基本结构 / break语句 / continue语句\nfor循环 - 基本结构 / range类型 / 循环中的分支结构 / 嵌套的循环 / 提前结束程序\n应用案例 - 1~100求和 / 判断素数 / 猜数字游戏 / 打印九九表 / 打印三角形图案 / 猴子吃桃 / 百钱百鸡\n\nDay05 - 总结和练习\n\n基础练习 - 水仙花数 / 完美数 / 五人分鱼 / Fibonacci数列 / 回文素数\n综合练习 - Craps赌博游戏\n\nDay06 - 函数和模块的使用\n\n函数的作用 - 代码的坏味道 / 用函数封装功能模块\n定义函数 - def语句 / 函数名 / 参数列表 / return语句 / 调用自定义函数\n调用函数 - Python内置函数 /  导入模块和函数\n函数的参数 - 默认参数 / 可变参数 / 关键字参数 / 命名关键字参数\n函数的返回值 - 没有返回值  / 返回单个值 / 返回多个值\n作用域问题 - 局部作用域 / 嵌套作用域 / 全局作用域 / 内置作用域 / 和作用域相关的关键字\n用模块管理函数 - 模块的概念 / 用自定义模块管理函数 / 命名冲突的时候会怎样（同一个模块和不同的模块）\n\nDay07 - 字符串和常用数据结构\n\n字符串的使用 - 计算长度 / 下标运算 / 切片 / 常用方法\n列表基本用法 - 定义列表 / 用下表访问元素 / 下标越界 / 添加元素 / 删除元素 / 修改元素 / 切片 / 循环遍历\n列表常用操作 - 连接 / 复制(复制元素和复制数组) / 长度 / 排序 / 倒转 / 查找\n生成列表 - 使用range创建数字列表 / 生成表达式 / 生成器\n元组的使用 - 定义元组 / 使用元组中的值 / 修改元组变量 / 元组和列表转换\n集合基本用法 - 集合和列表的区别 /  创建集合 / 添加元素 / 删除元素 /  清空\n集合常用操作 - 交集 / 并集 / 差集 / 对称差 / 子集 / 超集\n字典的基本用法 - 字典的特点 / 创建字典 / 添加元素 / 删除元素 / 取值 / 清空\n字典常用操作 - keys()方法 / values()方法 / items()方法 / setdefault()方法\n基础练习 - 跑马灯效果 / 列表找最大元素 / 统计考试成绩的平均分 / Fibonacci数列 / 杨辉三角\n综合案例 - 双色球选号 / 井字棋\n\nDay08 - 面向对象编程基础\n\n类和对象 - 什么是类 / 什么是对象 / 面向对象其他相关概念\n定义类 - 基本结构 / 属性和方法 / 构造器 / 析构器 / __str__方法\n使用对象 - 创建对象 / 给对象发消息\n面向对象的四大支柱 - 抽象 / 封装 / 继承 / 多态\n基础练习 - 定义学生类 / 定义时钟类 / 定义图形类 / 定义汽车类\n\nDay09 - 面向对象进阶\n\n属性 - 类属性 / 实例属性 / 属性访问器 / 属性修改器 / 属性删除器 / 使用__slots__\n类中的方法 - 实例方法 / 类方法 / 静态方法\n运算符重载 - __add__ / __sub__ / __or__ /__getitem__ / __setitem__ / __len__ / __repr__ / __gt__ / __lt__ / __le__ / __ge__ / __eq__ / __ne__ / __contains__\n类(的对象)之间的关系 - 关联 / 继承 / 依赖\n继承和多态 - 什么是继承 / 继承的语法 / 调用父类方法 / 方法重写 / 类型判定 / 多重继承 / 菱形继承(钻石继承)和C3算法\n综合案例 - 工资结算系统 / 图书自动折扣系统 / 自定义分数类\n\nDay10 - 图形用户界面和游戏开发\n\n使用tkinter开发GUI\n使用pygame三方库开发游戏应用\n“大球吃小球”游戏\n\nDay11 - 文件和异常\n\n读文件 - 读取整个文件 / 逐行读取 / 文件路径\n写文件 - 覆盖写入 / 追加写入 / 文本文件 / 二进制文件\n异常处理 - 异常机制的重要性 / try-except代码块 / else代码块 / finally代码块 / 内置异常类型 / 异常栈 / raise语句\n数据持久化 - CSV文件概述 / csv模块的应用 / JSON数据格式 / json模块的应用\n综合案例 - 歌词解析\n\nDay12 - 字符串和正则表达式\n\n字符串高级操作 - 转义字符 \\ 原始字符串 \\ 多行字符串 \\ in和 not in运算符 \\ is开头的方法 \\ join和split方法 \\ strip相关方法 \\ pyperclip模块 \\ 不变字符串和可变字符串 \\ StringIO的使用\n正则表达式入门 - 正则表达式的作用 \\ 元字符 \\ 转义 \\ 量词 \\ 分组 \\ 零宽断言 \\贪婪匹配与惰性匹配懒惰 \\ 使用re模块实现正则表达式操作（匹配、搜索、替换、捕获）\n使用正则表达式 - re模块 \\ compile函数 \\ group和groups方法 \\ match方法 \\ search方法 \\ findall和finditer方法 \\ sub和subn方法 \\ split方法\n应用案例 - 使用正则表达式验证输入的字符串\n\nDay13 - 进程和线程\n\n进程和线程的概念 - 什么是进程 / 什么是线程 / 多线程的应用场景\n使用进程 - fork函数 / multiprocessing模块 / 进程池 / 进程间通信\n使用线程 - thread模块 / threading模块 / Thread类 / Lock类 / Condition类 / 线程池\n\nDay14-A - 网络编程入门\n\n计算机网络基础 - 计算机网络发展史 / “TCP-IP”模型 / IP地址 / 端口 / 协议 / 其他相关概念\n网络应用架构 - “客户端-服务器”架构 / “浏览器-服务器”架构\nPython网络编程 - 套接字的概念 / socket模块 /  socket函数 / 创建TCP服务器 / 创建TCP客户端 / 创建UDP服务器 / 创建UDP客户端 / SocketServer模块\n\nDay14-B - 网络应用开发\n\n访问网络API - 网络API概述 / 访问URL / requests模块 / 解析JSON格式数据\n文件传输 - FTP协议 / ftplib模块 / 交互式FTP应用\n电子邮件 - SMTP协议 / POP3协议 / IMAP协议 / smtplib模块 / poplib模块 / imaplib模块\n短信服务 - twilio模块 / 国内的短信服务\n\nDay15 - 图像和文档处理\n\n用Pillow处理图片 - 图片读写 / 图片合成 / 几何变换 / 色彩转换 / 滤镜效果\n读写Word文档 - 文本内容的处理 / 段落 / 页眉和页脚 / 样式的处理\n读写Excel文件 - xlrd模块 / xlwt模块\n生成PDF文件 - pypdf2模块 / reportlab模块\n\nDay16~Day20 - Python语言进阶 \n\n常用数据结构\n函数的高级用法 - “一等公民” / 高阶函数 / Lambda函数 / 作用域和闭包 / 装饰器\n面向对象高级知识 - “三大支柱” / 类与类之间的关系 / 垃圾回收 / 魔术属性和方法 / 混入 / 元类 / 面向对象设计原则 / GoF设计模式\n迭代器和生成器 - 相关魔术方法 / 创建生成器的两种方式 /\n并发和异步编程 - 多线程 / 多进程 / 异步IO / async和await\n\nDay21~30 - Web前端入门\n\n用HTML标签承载页面内容\n用CSS渲染页面\n用JavaScript处理交互式行为\njQuery入门和提高\nVue.js入门\nElement的使用\nBootstrap的使用\n\nDay31~35 - 玩转Linux操作系统\n\n操作系统发展史和Linux概述\nLinux基础命令\nLinux中的实用程序\nLinux的文件系统\nVim编辑器的应用\n环境变量和Shell编程\n软件的安装和服务的配置\n网络访问和管理\n其他相关内容\n\nDay36~40 - 数据库基础和进阶\n\n关系型数据库MySQL\n\n关系型数据库概述\nMySQL的安装和使用\nSQL的使用\n\nDDL - 数据定义语言 - create / drop / alter\nDML - 数据操作语言 - insert / delete / update / select\nDCL - 数据控制语言 - grant / revoke\n\n\n相关知识\n\n范式理论 - 设计二维表的指导思想\n数据完整性\n数据一致性\n\n\n在Python中操作MySQL\n\n\nNoSQL入门\n\nNoSQL概述\nRedis概述\nMongo概述\n\n\n\nDay41~55 - 实战Django\nDay41 - 快速上手\n\nWeb应用工作原理和HTTP协议\nDjango框架概述\n5分钟快速上手\n使用视图模板\n\nDay42 - 深入模型\n\n关系型数据库配置\n管理后台的使用\n使用ORM完成对模型的CRUD操作\nDjango模型最佳实践\n模型定义参考\n\nDay43 - 静态资源和Ajax请求\n\n加载静态资源\n用Ajax请求获取数据\n\nDay44 - 表单的应用\nDay45 - Cookie和Session\nDay46 - 中间件的应用\nDay47 - 日志和缓存\nDay48 - 文件上传和富文本编辑\nDay49 - 文件下载和报表\nDay50 - RESTful架构和DRF入门\nDay51 - RESTful架构和DRF进阶\nDay52 - 使用缓存\nDay53 - 短信和邮件\nDay54 - 异步任务和定时任务\nDay55 - 单元测试和项目上线\n\n项目开发流程和相关工具\n生成非HTML内容\n项目部署和测试\n项目性能初步调优\nWeb应用安全保护\n\nDay56~60 - 实战Flask\nDay56 - Flask入门\nDay57 - 模板的使用\nDay58 - 表单的处理\nDay59 - 数据库操作\nDay60 - 项目实战\nDay61~65 - 实战Tornado\nDay61 - 预备知识\n\n并发编程\nI/O模式和事件驱动\n\nDay62 - Tornado入门\n\nTornado概述\n5分钟上手Tornado\n路由解析\n请求处理器\n\nDay63 - 异步化\n\naiomysql和aioredis的使用\n\nDay64 - WebSocket的应用\n\nWebSocket简介\nWebSocket服务器端编程\nWebSocket客户端编程\n项目：Web聊天室\n\nDay65 - 项目实战\n\n前后端分离开发和接口文档的撰写\n使用Vue.js实现前端渲染\n使用ECharts实现报表功能\n使用WebSocket实现推送服务\n\nDay66~75 - 爬虫开发\nDay66 - 网络爬虫和相关工具\nDay67 - 数据采集和解析\nDay68 - 存储数据\nDay69 - 并发下载\nDay70 - 解析动态内容\nDay71 - 表单交互和验证码处理\nDay72 - Scrapy入门\nDay73 - Scrapy高级应用\nDay74 - Scrapy分布式实现\nDay75 - 爬虫项目实战\nDay76~90 - 数据处理和机器学习\nDay76 - 机器学习基础\nDay77 - Pandas的应用\nDay78 - NumPy和SciPy的应用\nDay79 - Matplotlib和数据可视化\nDay80 - k最近邻(KNN)分类\nDay81 - 决策树\nDay82 - 贝叶斯分类\nDay83 - 支持向量机(SVM)\nDay84 - K-均值聚类\nDay85 - 回归分析\nDay86 - 大数据分析入门\nDay87 - 大数据分析进阶\nDay88 - Tensorflow入门\nDay89 - Tensorflow实战\nDay90 - 推荐系统\nDay91~100 - 团队项目开发\n第91天：团队开发和项目选题\n\n\n软件过程模型\n\n\n经典过程模型（瀑布模型）\n\n可行性分析（研究做还是不做），输出《可行性分析报告》。\n需求分析（研究做什么），输出《需求规格说明书》和产品界面原型图。\n概要设计和详细设计，输出概念模型图、物理模型图、类图、时序图等。\n编码 / 测试。\n上线 / 维护。\n\n\n\n敏捷开发（Scrum）- 产品所有者、Scrum Master、研发人员 - Sprint\n\n产品的Backlog（用户故事、产品原型）。\n计划会议（评估和预算）。\n日常开发（站立会议、番茄工作法、结对编程、测试先行、代码重构……）。\n修复bug（问题描述、重现步骤、测试人员、被指派人）。\n评审会议（Showcase）。\n回顾会议（当前周期做得好和不好的地方）。\n\n\n补充：敏捷软件开发宣言\n\n个体和互动 高于 流程和工具\n工作的软件 高于 详尽的文档\n客户合作 高于 合同谈判\n响应变化 高于 遵循计划\n\n\n\n\n\n\n角色：产品所有者（决定做什么，能对需求拍板的人）、团队负责人（解决各种问题，专注如何更好的工作，屏蔽外部对开发团队的影响）、开发团队（项目执行人员，具体指开发人员和测试人员）。\n准备工作：商业案例和资金、合同、憧憬、初始产品需求、初始发布计划、入股、组建团队。\n敏捷团队通常人数为8-10人。\n工作量估算：将开发任务量化，包括原型、Logo设计、UI设计、前端开发等，尽量把每个工作分解到最小任务量，最小任务量标准为工作时间不能超过两天，然后估算总体项目时间。把每个任务都贴在白板上面，白板上分三部分：to do（待完成）、in progress（进行中）和done（已完成）。\n\n\n\n项目团队组建\n\n\n团队的构成和角色\n\n说明：谢谢付祥英女士绘制了下面这张精美的公司组织架构图。\n\n\n\n\n编程规范和代码审查（flake8、pylint）\n\n\n\nPython中的一些“惯例”（请参考《Python惯例-如何编写Pythonic的代码》）\n\n\n影响代码可读性的原因：\n\n代码注释太少或者没有注释\n代码破坏了语言的最佳实践\n反模式编程（意大利面代码、复制-黏贴编程、自负编程、……）\n\n\n\n\n\n团队开发工具介绍\n\n版本控制：Git、Mercury\n缺陷管理：Gitlab、Redmine\n敏捷闭环工具：禅道、JIRA\n持续集成：Jenkins、Travis-CI\n\n请参考《团队项目开发》。\n\n\n项目选题和理解业务\n\n\n选题范围设定\n\n\nCMS（用户端）：新闻聚合网站、问答/分享社区、影评/书评网站等。\n\n\nMIS（用户端+管理端）：KMS、KPI考核系统、HRS、CRM系统、供应链系统、仓储管理系统等。\n\n\nApp后台（管理端+数据接口）：二手交易类、报刊杂志类、小众电商类、新闻资讯类、旅游类、社交类、阅读类等。\n\n\n其他类型：自身行业背景和工作经验、业务容易理解和把控。\n\n\n\n\n需求理解、模块划分和任务分配\n\n需求理解：头脑风暴和竞品分析。\n模块划分：画思维导图（XMind），每个模块是一个枝节点，每个具体的功能是一个叶节点（用动词表述），需要确保每个叶节点无法再生出新节点，确定每个叶子节点的重要性、优先级和工作量。\n任务分配：由项目负责人根据上面的指标为每个团队成员分配任务。\n\n\n\n\n制定项目进度表（每日更新）\n\n\n\n模块\n功能\n人员\n状态\n完成\n工时\n计划开始\n实际开始\n计划结束\n实际结束\n备注\n\n\n\n\n评论\n添加评论\n王大锤\n正在进行\n50%\n4\n2018/8/7\n\n2018/8/7\n\n\n\n\n\n删除评论\n王大锤\n等待\n0%\n2\n2018/8/7\n\n2018/8/7\n\n\n\n\n\n查看评论\n白元芳\n正在进行\n20%\n4\n2018/8/7\n\n2018/8/7\n\n需要进行代码审查\n\n\n\n评论投票\n白元芳\n等待\n0%\n4\n2018/8/8\n\n2018/8/8\n\n\n\n\n\n\n\n第92天：数据库设计和OOAD\n概念模型和正向工程\n\n\nUML（统一建模语言）的类图\n\n\n\n通过模型创建表（正向工程）\npython manage.py makemigrations app\npython manage.py migrate\n\n\n物理模型和反向工程\n\n\nPowerDesigner\n\n\n\n通过数据表创建模型（反向工程）\npython manage.py inspectdb > app/models.py\n\n\n第93-98天：使用Django开发项目\n\n说明：具体内容请参考《Django知识点概述》\n\n项目开发中的公共问题\n\n数据库的配置（多数据库、主从复制、数据库路由）\n缓存的配置（分区缓存、键设置、超时设置、主从复制、故障恢复（哨兵））\n日志的配置\n分析和调试（Django-Debug-ToolBar）\n好用的Python模块（日期计算、图像处理、数据加密、三方API）\n\nREST API设计\n\nRESTful架构\n\n理解RESTful架构\nRESTful API设计指南\nRESTful API最佳实践\n\n\nAPI接口文档的撰写（《网络API接口设计》）\n\nRAP2\nYAPI\n\n\ndjango-REST-framework的应用\n\n项目中的重点难点剖析\n\n使用缓存缓解数据库压力 - Redis\n使用消息队列做解耦合和削峰 - Celery + RabbitMQ\n\n第99-100天：测试和部署\n单元测试\n\n测试的种类\n编写单元测试（unittest、pytest、nose2、tox、ddt、……）\n测试覆盖率（coverage）\n\n项目部署\n\n说明：请参考《项目部署上线指南》。\n\n\n部署前的准备工作\n\n关键设置（SECRET_KEY / DEBUG / ALLOWED_HOSTS / 缓存 / 数据库）\nHTTPS / CSRF_COOKIE_SECUR  / SESSION_COOKIE_SECURE\n日志相关配置\n\n\nLinux常用命令回顾\nLinux常用服务的安装和配置\nuWSGI/Gunicorn和Nginx的使用\n\nGunicorn和uWSGI的比较\n\n对于不需要大量定制化的简单应用程序，Gunicorn是一个不错的选择，uWSGI的学习曲线比Gunicorn要陡峭得多，Gunicorn的默认参数就已经能够适应大多数应用程序。\nuWSGI支持异构部署。\n由于Nginx本身支持uWSGI，在线上一般都将Nginx和uWSGI捆绑在一起部署，而且uWSGI属于功能齐全且高度定制的WSGI中间件。\n在性能上，Gunicorn和uWSGI其实表现相当。\n\n\n\n\n虚拟化技术（Docker）\n\n性能测试\n\n说明：具体内容请参考《Django知识点概述》。\n\n\nAB的使用\nSQLslap的使用\nsysbench的使用\n\n自动化测试\n\n使用Shell和Python进行自动化测试\n使用Selenium实现自动化测试\n\nSelenium IDE\nSelenium WebDriver\nSelenium Remote Control\n\n\n测试工具Robot Framework介绍\n\n项目性能调优\n\n\n数据库性能调优 - 请参考《MySQL相关知识》\n\n\n软硬件优化\n\n\nSQL优化\n\n\n架构优化\n\n\n分表分库\n\n\n主从复制，读写分离\n\n\n集群架构\n\n\n\n\n\n\nWeb服务器性能优化\n\n\nNginx负载均衡配置\n\n\nKeepalived实现高可用\n\n\n\n\n代码性能调优\n\n多线程\n异步化\n\n\n\n静态资源访问优化\n\n云存储\nCDN\n\n\n\n\n致谢：感谢的我的同事古晔、张旭、肖世荣、王海飞、荣佳伟、路丰坤等在技术上给予的指导和帮助。\n\n"}, {"title": "kkuchta/css-only-chat", "language": "Ruby", "content": "\nCSS-Only Chat\nA truly monstrous async web chat using no JS whatsoever on the frontend.\n\nWait what\nThis is an asynchronous chat that sends + receives messages in the browser with no reloads and no javascript.\nOk so how\nBackground-images loaded via pseudoselectors + a forever-loading index page (remember Comet?).\nSay that again?\nOk, so there are two things we need the browser to do: send data and receive data.  Let's start with the first.\nSending Data\nCSS is really limited in what it can do.  However, we can use it to effectively detect button presses:\n.some-button:active {\n  background-image: url('some_image.jpg')\n}\n\nWhat's cool is that a browser won't actually load that background image until this selector is used - that is, when this button is pressed.  So now we have a way to trigger a request to a server of our choice on a button press.  That sounds like data sending!\nNow, of course, this only works once per button (since a browser won't try to load that image twice), but it's a start.\nReceiving Data\nSince we can't use JS, it's really hard to change a page after it's already been loaded.  But it is possible.\nBack before websockets were widely supported, we had to use clever hacks if we wanted to push data from a server to a client in an ongoing basis.  One such hack was just to make the page never finish loading.  It turns out that you can tell the browser to start rendering a page before it's finished loading (using the Transfer-Encoding: chunked http header).  And when you do that, you don't actually have to stop loading the page.  You can just keep adding stuff to the bottom of the html forever, at whatever rate you want.\nSo, for example, you could start sending a normal html page, then just stop sending html (while still telling the client you're sending) until you're ready to deliver another message.\nNow, all this lets us do is periodically append html to the page.  What can we do with that?  How about, when you load the index page, this happens:\n\nWe load up the first pile of html we want to show.  A welcome message, etc.\nWe stop loading html for a while until we want to send some sort of update.\nNow we load up a <style> element that display: none's all the previous html\nThen we load up whatever new html we want to show\nFinally we wait until the next update we want to send and GOTO 3.\n\nSingle-use buttons?\nOk, so we have that problem earlier where each button is only single-use.  It tries to send a get request once, then never will again.\nThankfully, our method of receiving data fixes that for us.  Here's what happens:\n\nWe show an \"a\" button whose background image is like \"img/a\".\nWhen you press it, the server receives the image request for \"a\"\nThe server then pushes an update to the client to hide the current button and replace it with one whose background images is \"image/aa\".\n\nIf the buttons you pressed were \"h\", \"e\", and \"l\", then the \"a\" button's background image url would be \"img/hela\".  And since we're replacing all buttons every time you press one, the single-use button problem goes away!\nMisc other details\n\nWe actually encode a bit more info into the button urls (like each client's id)\nBecause the data-sending and data-receiving happens on different threads, we need inter-thread communication.  That sounds like work, so we'll just use Redis pubsub for that.\n\nFAQ\nWhat inspired this? Chernobyl, Hindenburg, The Tacoma Narrows Bridge...\nReally? No, it was this clever tweet by davywtf.\nWhy's your code suck Why do you suck?\nNo but really Because I was mostly making this up as I went.  There's a lot of exploratory coding here that I only minimally cleaned up.  If I rebuilt it I'd store the UI state for a client in redis and just push it out in its entirety when needed via a single generic screen-updating mechanism.\nWhat could go wrong with this technique? Broken by browser bg-image handling changes; long-request timeouts; running out of threads; fast-clicking bugs; generic concurrency headaches; poor handling by proxies; it's crazy inaccessible; etc etc\nShould I use this in real life? Dear god yes.\nI have an idea for how this could be made better/worse/hackier Tweet at me (@kkuchta).  I'm always down to see a terrible idea taken further!\n"}, {"title": "microsoft/PowerToys", "language": "Ruby", "content": "\nCSS-Only Chat\nA truly monstrous async web chat using no JS whatsoever on the frontend.\n\nWait what\nThis is an asynchronous chat that sends + receives messages in the browser with no reloads and no javascript.\nOk so how\nBackground-images loaded via pseudoselectors + a forever-loading index page (remember Comet?).\nSay that again?\nOk, so there are two things we need the browser to do: send data and receive data.  Let's start with the first.\nSending Data\nCSS is really limited in what it can do.  However, we can use it to effectively detect button presses:\n.some-button:active {\n  background-image: url('some_image.jpg')\n}\n\nWhat's cool is that a browser won't actually load that background image until this selector is used - that is, when this button is pressed.  So now we have a way to trigger a request to a server of our choice on a button press.  That sounds like data sending!\nNow, of course, this only works once per button (since a browser won't try to load that image twice), but it's a start.\nReceiving Data\nSince we can't use JS, it's really hard to change a page after it's already been loaded.  But it is possible.\nBack before websockets were widely supported, we had to use clever hacks if we wanted to push data from a server to a client in an ongoing basis.  One such hack was just to make the page never finish loading.  It turns out that you can tell the browser to start rendering a page before it's finished loading (using the Transfer-Encoding: chunked http header).  And when you do that, you don't actually have to stop loading the page.  You can just keep adding stuff to the bottom of the html forever, at whatever rate you want.\nSo, for example, you could start sending a normal html page, then just stop sending html (while still telling the client you're sending) until you're ready to deliver another message.\nNow, all this lets us do is periodically append html to the page.  What can we do with that?  How about, when you load the index page, this happens:\n\nWe load up the first pile of html we want to show.  A welcome message, etc.\nWe stop loading html for a while until we want to send some sort of update.\nNow we load up a <style> element that display: none's all the previous html\nThen we load up whatever new html we want to show\nFinally we wait until the next update we want to send and GOTO 3.\n\nSingle-use buttons?\nOk, so we have that problem earlier where each button is only single-use.  It tries to send a get request once, then never will again.\nThankfully, our method of receiving data fixes that for us.  Here's what happens:\n\nWe show an \"a\" button whose background image is like \"img/a\".\nWhen you press it, the server receives the image request for \"a\"\nThe server then pushes an update to the client to hide the current button and replace it with one whose background images is \"image/aa\".\n\nIf the buttons you pressed were \"h\", \"e\", and \"l\", then the \"a\" button's background image url would be \"img/hela\".  And since we're replacing all buttons every time you press one, the single-use button problem goes away!\nMisc other details\n\nWe actually encode a bit more info into the button urls (like each client's id)\nBecause the data-sending and data-receiving happens on different threads, we need inter-thread communication.  That sounds like work, so we'll just use Redis pubsub for that.\n\nFAQ\nWhat inspired this? Chernobyl, Hindenburg, The Tacoma Narrows Bridge...\nReally? No, it was this clever tweet by davywtf.\nWhy's your code suck Why do you suck?\nNo but really Because I was mostly making this up as I went.  There's a lot of exploratory coding here that I only minimally cleaned up.  If I rebuilt it I'd store the UI state for a client in redis and just push it out in its entirety when needed via a single generic screen-updating mechanism.\nWhat could go wrong with this technique? Broken by browser bg-image handling changes; long-request timeouts; running out of threads; fast-clicking bugs; generic concurrency headaches; poor handling by proxies; it's crazy inaccessible; etc etc\nShould I use this in real life? Dear god yes.\nI have an idea for how this could be made better/worse/hackier Tweet at me (@kkuchta).  I'm always down to see a terrible idea taken further!\n"}, {"title": "jolaleye/cssfx", "language": "Vue", "content": "\n\nBeautifully simple click-to-copy CSS effects\n\n\nhttps://cssfx.dev\n\nTo run locally, npm install then npm run dev.\nContributing\nCheck out the contributing guide to learn how you can help out!\nAlways be sure to follow the Code of Conduct.\nLicense\nThe CSSFX site and effects are MIT licensed.\n"}, {"title": "MisterBooo/LeetCodeAnimation", "language": "Vue", "content": "\n\nBeautifully simple click-to-copy CSS effects\n\n\nhttps://cssfx.dev\n\nTo run locally, npm install then npm run dev.\nContributing\nCheck out the contributing guide to learn how you can help out!\nAlways be sure to follow the Code of Conduct.\nLicense\nThe CSSFX site and effects are MIT licensed.\n"}, {"title": "flutter/flutter_web", "language": "Dart", "content": "\nWelcome to the code repository for Flutter for web.\nThis repository contains the source code for a fork of\nFlutter that targets the web. Our goal is to add web\nsupport as a first-tier platform in the Flutter SDK alongside iOS and Android.\nThe code in this repository is a stepping stone to that goal,\nproviding web-only packages that implement (almost) the entire Flutter API.\nWeb support for Flutter is not yet stable. We're designating this release as a\ntechnical preview, designed to validate that the product\nmeets developers' needs, iterate on major features and get to feature complete.\nDesign and implementation may change significantly, and changes may be\nintroduced that break compatibility with existing code. As a result, the Flutter\nteam do not recommend using code created with Flutter for web in production\nat this time.\nYou can find a\nshort introduction to Flutter for web\non our blog.\nImportant notes\nLimitations\nWe intend to completely support all of Flutter's API and functionality across\nmodern browsers. However, during this preview, there are a number of exceptions:\n\nflutter_web does not have a plugin system yet. Temporarily, we provide\naccess to dart:html, dart:js, dart:svg, dart:indexed_db and other web\nlibraries that give you access to the vast majority of browser APIs. However,\nexpect that these libraries will be replaced by a different plugin API.\nNot all Flutter APIs are implemented on Flutter for web yet.\nPerformance work is only just beginning. The code generated by Flutter for web\nmay run slowly, or demonstrate significant UI \"jank\".\nAt this time, desktop UI interactions are not fully complete, so a UI built\nwith flutter_web may feel like a mobile app, even\nwhen running on a desktop browser.\nThe development workflow is only designed to work with Chrome at the moment.\n\nBrowser support\nFlutter for web provides:\n\na production JavaScript compiler\nthat generates optimized, minified code for deployment\na development JavaScript compiler,\nthat offers incremental compilation and hot restart\n\nWhen built with the production compiler, Flutter supports Chromium-based\nbrowsers and Safari, both on desktop and mobile. We also aim to fully support\nFirefox and Edge as targeted platforms, but our own test coverage is still low\non these browsers. Our intention is to support the current and the last two\nmajor releases. Feedback on rendering and performance issues on all of these\nbrowsers is appreciated.\nInternet Explorer support is not planned.\nThe development compiler currently supports Chrome only.\nTesting Flutter for web\nWhile we are far from code complete, we're ready for you to start developing\nand experimenting with Flutter for web. We are building the product around a\nnumber of target scenarios,\nas described in our blog,\nand we'd appreciate your feedback on feature gaps or suitability for these\nscenarios, as well as other scenarios for which you find Flutter useful on the\nweb.\nIn addition, we'd love to see repros that demonstrate crashes, rendering\nfidelity issues or extreme performance issues. We'd also love general feedback\non the quality of the release and the developer experience.\nOf particular interest to us is testing across a variety of operating systems\nused for development (Windows, Linux, Mac) and browsers used for deployment.\nSince we are developing this in a separate fork to the main Flutter repo, we are\nnot yet ready to accept GitHub pull requests at this time. However,\nGitHub issues are very welcome.\nSamples\nCheck out flutter.github.io/samples.\nGetting started\nFlutter 1.5 and above enable support for targeting the web with Flutter,\nincluding Dart compilation to JavaScript. To use the Flutter SDK with the\nflutter_web preview make sure you have upgraded Flutter to at least v1.5.4\nby running flutter upgrade from your machine. If you're actively developing\nfor Flutter for web, you may prefer to be running from one of the unstable\nchannels. Our wiki describes the\nFlutter channels\nand how to select the right one for your needs.\nClone the flutter_web source code\nClone this repository locally.\nInstall the flutter_web build tools\nTo install the\nwebdev package,\nwhich provides the build tools for Flutter for web, run the following:\n$ flutter packages pub global activate webdev\nEnsure that the $HOME/.pub-cache/bin directory\nis in your path,\nand then you may use the webdev command directly from your terminal.\n\nNote: if you have problems configuring webdev to run directly, try:\nflutter packages pub global run webdev [command].\n\nRun the hello_world example\n\n\nThe example exists at examples/hello_world in the repository.\n$ cd examples/hello_world/\n\n\nUpdate packages.\n$ flutter packages upgrade\n! flutter_web 0.0.0 from path ../../flutter_web\n! flutter_web_ui 0.0.0 from path ../../flutter_web_ui\nRunning \"flutter packages upgrade\" in hello_world...                5.0s\nIf that succeeds, you're ready to run it!\n\n\nBuild and serve the example locally.\n$ webdev serve\n[INFO] Generating build script completed, took 331ms\n...\n[INFO] Building new asset graph completed, took 1.4s\n...\n[INFO] Running build completed, took 27.9s\n...\n[INFO] Succeeded after 28.1s with 618 outputs (3233 actions)\nServing `web` on http://localhost:8080\nOpen http://localhost:8080 in Chrome and you should see Hello World in\nred text in the upper-left corner.\n\n\nTools support for Flutter web development\nVisual Studio Code\nVisual Studio Code supports Flutter web development with the v3.0 release of\nthe Flutter extension.\n\ninstall the Flutter SDK\nset up VS Code\nconfigure VS Code to point to your local Flutter SDK\nrun the Flutter: New Web Project command from VS Code\nafter the project is created, run your app by pressing F5 or\n\"Debug -> Start Debugging\"\nVS Code will use the webdev command-line tool to build and run your app; a\nnew Chrome window should open, showing your running app\n\nUsing from IntelliJ\n\ninstall the Flutter SDK\nset up your copy of IntelliJ or\nAndroid Studio\nconfigure IntelliJ or Android Studio to point to your local Flutter SDK\ncreate a new Dart project; note, for a Flutter for web app, you want to start\nfrom the Dart project wizard, not the Flutter project wizard\nfrom the Dart project wizard, select the 'Flutter for web' option for the\napplication template\ncreate the project; pub get will be run automatically\nonce the project is created, hit the run button on the main toolbar\nIntelliJ will use the webdev command-line tool to build and run your app; a\nnew Chrome window should open, showing your running app\n\nWorkflow\nUse flutter_web packages from git\nIf you'd like to depend on the flutter_web packages without cloning the\nrepository, you can setup your pubspec as follows:\nname: my_flutter_web_app\n\nenvironment:\n  sdk: '>=2.2.0 <3.0.0'\n\ndependencies:\n  flutter_web: any\n  flutter_web_ui: any\n\ndev_dependencies:\n  # Enables the `pub run build_runner` command\n  build_runner: ^1.1.2\n  # Includes the JavaScript compilers\n  build_web_compilers: ^1.0.0\n\n# flutter_web packages are not published to pub.dartlang.org\n# These overrides tell the package tools to get them from GitHub\ndependency_overrides:\n  flutter_web:\n    git:\n      url: https://github.com/flutter/flutter_web\n      path: packages/flutter_web\n  flutter_web_ui:\n    git:\n      url: https://github.com/flutter/flutter_web\n      path: packages/flutter_web_ui\nGetting (stateless) hot-reload with webdev\nTo use webdev with hot-reload, run the following within your project\ndirectory:\n$ webdev serve --auto restart\nYou'll notice a similar output to flutter packages pub run build_runner serve\nbut now changes to your application code should cause a quick refresh of the\napplication on save.\n\nNote: the --hot-reload option is not perfect. If you notice unexpected\nbehavior, you may want to manually refresh the page.\n\n\nNote: the --hot-reload option is currently \"stateless\". Application state\nwill be lost on reload. We do hope to offer \"stateful\" hot-reload on the web\n– we're actively working on it!\n\nBuilding with the production JavaScript compiler\nThe workflow documented above (available with build_runner and webdev) uses\nthe Dart Dev Compiler which is\ndesigned for fast, incremental compilation and easy debugging.\nIf you'd like evaluate production performance, browser compatibility and code\nsize, you can enable our release compiler,\ndart2js.\nTo enable the release compiler, pass in the --release flag (or just -r).\n$ webdev serve -r\n\nNote: Builds may be slower in this configuration.\n\nIf you'd like to generate output to disk, we recommend you use webdev.\n$ webdev build\nThis will create a build directory with index.html, main.dart.js and the\nrest of the files needed to run the application using a static HTTP server.\nTo optimize the output JavaScript, you can enable optimization flags using a\nbuild.yaml file in the root of your project with the following contents:\n# See https://github.com/dart-lang/build/tree/master/build_web_compilers#configuration\ntargets:\n  $default:\n    builders:\n      build_web_compilers|entrypoint:\n        generate_for:\n        - web/**.dart\n        options:\n          dart2js_args:\n            - --no-source-maps\n            - -O4\n\nNote: the -O4 option enables a number of advanced optimizations that may\ncause runtime errors in code that has not been thoroughly tested.\n\nMigrating existing code\nIf you'd like to migrate existing Flutter code to run on the web preview, read\nthe migration guide.\n"}, {"title": "TheAlgorithms/Python", "language": "Python", "content": "The Algorithms - Python \n\nAll algorithms implemented in Python (for education)\nThese implementations are for demonstration purposes. They are less efficient than the implementations in the Python standard library.\nSorting Algorithms\nBubble Sort\n\nBubble sort, sometimes referred to as sinking sort, is a simple sorting algorithm that repeatedly steps through the list to be sorted, compares each pair of adjacent items and swaps them if they are in the wrong order. The pass through the list is repeated until no swaps are needed, which indicates that the list is sorted.\nProperties\n\nWorst case performance\tO(n2)\nBest case performance\tO(n)\nAverage case performance\tO(n2)\n\nSource: Wikipedia\nView the algorithm in action\nBucket\n\n\nBucket sort, or bin sort, is a sorting algorithm that works by distributing the elements of an array into a number of buckets. Each bucket is then sorted individually, either using a different sorting algorithm, or by recursively applying the bucket sorting algorithm.\nProperties\n\nWorst case performance\tO(n2)\nBest case performance\tO(n+k)\nAverage case performance\tO(n+k)\n\nSource: Wikipedia\nCocktail shaker\n\nCocktail shaker sort, also known as bidirectional bubble sort, cocktail sort, shaker sort (which can also refer to a variant of selection sort), ripple sort, shuffle sort, or shuttle sort, is a variation of bubble sort that is both a stable sorting algorithm and a comparison sort. The algorithm differs from a bubble sort in that it sorts in both directions on each pass through the list.\nProperties\n\nWorst case performance\tO(n2)\nBest case performance\tO(n)\nAverage case performance\tO(n2)\n\nSource: Wikipedia\nInsertion Sort\n\nInsertion sort is a simple sorting algorithm that builds the final sorted array (or list) one item at a time. It is much less efficient on large lists than more advanced algorithms such as quicksort, heapsort, or merge sort.\nProperties\n\nWorst case performance\tO(n2)\nBest case performance\tO(n)\nAverage case performance\tO(n2)\n\nSource: Wikipedia\nView the algorithm in action\nMerge Sort\n\nMerge sort (also commonly spelled mergesort) is an efficient, general-purpose, comparison-based sorting algorithm. Most implementations produce a stable sort, which means that the implementation preserves the input order of equal elements in the sorted output. Mergesort is a divide and conquer algorithm that was invented by John von Neumann in 1945.\nProperties\n\nWorst case performance\tO(n log n)\nBest case performance\tO(n log n)\nAverage case performance\tO(n log n)\n\nSource: Wikipedia\nView the algorithm in action\nQuick\n\nQuicksort (sometimes called partition-exchange sort) is an efficient sorting algorithm, serving as a systematic method for placing the elements of an array in order.\nProperties\n\nWorst case performance\tO(n2)\nBest case performance\tO(n log n) or O(n) with three-way partition\nAverage case performance\tO(n log n)\n\nSource: Wikipedia\nView the algorithm in action\nHeap\n\nHeapsort is a comparison-based sorting algorithm. It can be thought of as an improved selection sort. It divides its input into a sorted and an unsorted region, and it iteratively shrinks the unsorted region by extracting the largest element and moving that to the sorted region.\nProperties\n\nWorst case performance\tO(n log n)\nBest case performance\tO(n log n)\nAverage case performance\tO(n log n)\n\nSource: Wikipedia\nView the algorithm in action\nRadix\nFrom Wikipedia: Radix sort is a non-comparative integer sorting algorithm that sorts data with integer keys by grouping keys by the individual digits which share the same significant position and value.\nProperties\n\nWorst case performance\tO(wn)\nBest case performance\tO(wn)\nAverage case performance\tO(wn)\n\nSource: Wikipedia\nSelection\n\nSelection sort is an algorithm that divides the input list into two parts: the sublist of items already sorted, which is built up from left to right at the front (left) of the list, and the sublist of items remaining to be sorted that occupy the rest of the list. Initially, the sorted sublist is empty and the unsorted sublist is the entire input list. The algorithm proceeds by finding the smallest (or largest, depending on sorting order) element in the unsorted sublist, exchanging (swapping) it with the leftmost unsorted element (putting it in sorted order), and moving the sublist boundaries one element to the right.\nProperties\n\nWorst case performance\tO(n2)\nBest case performance\tO(n2)\nAverage case performance\tO(n2)\n\nSource: Wikipedia\nView the algorithm in action\nShell\n\nShellsort is a generalization of insertion sort that allows the exchange of items that are far apart.  The idea is to arrange the list of elements so that, starting anywhere, considering every nth element gives a sorted list.  Such a list is said to be h-sorted.  Equivalently, it can be thought of as h interleaved lists, each individually sorted.\nProperties\n\nWorst case performance O(nlog2n)\nBest case performance O(n log n)\nAverage case performance depends on gap sequence\n\nSource: Wikipedia\nView the algorithm in action\nTopological\nFrom Wikipedia: Topological sort, or topological ordering of a directed graph is a linear ordering of its vertices such that for every directed edge uv from vertex u to vertex v, u comes before v in the ordering. For instance, the vertices of the graph may represent tasks to be performed, and the edges may represent constraints that one task must be performed before another; in this application, a topological ordering is just a valid sequence for the tasks. A topological ordering is possible if and only if the graph has no directed cycles, that is, if it is a directed acyclic graph (DAG). Any DAG has at least one topological ordering, and algorithms are known for constructing a topological ordering of any DAG in linear time.\nTime-Complexity Graphs\nComparing the complexity of sorting algorithms (Bubble Sort, Insertion Sort, Selection Sort)\n\nComparing the sorting algorithms:\n  -Quicksort is a very fast algorithm but can be pretty tricky to implement\n  -Bubble sort is a slow algorithm but is very easy to implement. To sort small sets of data, bubble sort may be a better option since it can be implemented quickly, but for larger datasets, the speedup from quicksort might be worth the trouble implementing the algorithm.\n\nSearch Algorithms\nLinear\n\nLinear search or sequential search is a method for finding a target value within a list. It sequentially checks each element of the list for the target value until a match is found or until all the elements have been searched. Linear search runs in at worst linear time and makes at most n comparisons, where n is the length of the list.\nProperties\n\nWorst case performance\tO(n)\nBest case performance\tO(1)\nAverage case performance\tO(n)\nWorst case space complexity\tO(1) iterative\n\nSource: Wikipedia\nBinary\n\nBinary search, also known as half-interval search or logarithmic search, is a search algorithm that finds the position of a target value within a sorted array. It compares the target value to the middle element of the array; if they are unequal, the half in which the target cannot lie is eliminated and the search continues on the remaining half until it is successful.\nProperties\n\nWorst case performance\tO(log n)\nBest case performance\tO(1)\nAverage case performance\tO(log n)\nWorst case space complexity\tO(1)\n\nSource: Wikipedia\nInterpolation\nInterpolation search is an algorithm for searching for a key in an array that has been ordered by numerical values assigned to the keys (key values). It was first described by W. W. Peterson in 1957. Interpolation search resembles the method by which people search a telephone directory for a name (the key value by which the book's entries are ordered): in each step the algorithm calculates where in the remaining search space the sought item might be, based on the key values at the bounds of the search space and the value of the sought key, usually via a linear interpolation. The key value actually found at this estimated position is then compared to the key value being sought. If it is not equal, then depending on the comparison, the remaining search space is reduced to the part before or after the estimated position. This method will only work if calculations on the size of differences between key values are sensible.\nBy comparison, binary search always chooses the middle of the remaining search space, discarding one half or the other, depending on the comparison between the key found at the estimated position and the key sought — it does not require numerical values for the keys, just a total order on them. The remaining search space is reduced to the part before or after the estimated position. The linear search uses equality only as it compares elements one-by-one from the start, ignoring any sorting.\nOn average the interpolation search makes about log(log(n)) comparisons (if the elements are uniformly distributed), where n is the number of elements to be searched. In the worst case (for instance where the numerical values of the keys increase exponentially) it can make up to O(n) comparisons.\nIn interpolation-sequential search, interpolation is used to find an item near the one being searched for, then linear search is used to find the exact item.\nSource: Wikipedia\nJump Search\nJump search or block search refers to a search algorithm for ordered lists. It works by first checking all items Lkm, where {\\displaystyle k\\in \\mathbb {N} } k\\in \\mathbb {N}  and m is the block size, until an item is found that is larger than the search key. To find the exact position of the search key in the list a linear search is performed on the sublist L[(k-1)m, km].\nThe optimal value of m is √n, where n is the length of the list L. Because both steps of the algorithm look at, at most, √n items the algorithm runs in O(√n) time. This is better than a linear search, but worse than a binary search. The advantage over the latter is that a jump search only needs to jump backwards once, while a binary can jump backwards up to log n times. This can be important if a jumping backwards takes significantly more time than jumping forward.\nThe algorithm can be modified by performing multiple levels of jump search on the sublists, before finally performing the linear search. For an k-level jump search the optimum block size ml for the lth level (counting from 1) is n(k-l)/k. The modified algorithm will perform k backward jumps and runs in O(kn1/(k+1)) time.\nSource: Wikipedia\nQuick Select\n\nQuick Select is a selection algorithm to find the kth smallest element in an unordered list. It is related to the quicksort sorting algorithm. Like quicksort, it was developed by Tony Hoare, and thus is also known as Hoare's selection algorithm.[1] Like quicksort, it is efficient in practice and has good average-case performance, but has poor worst-case performance. Quickselect and its variants are the selection algorithms most often used in efficient real-world implementations.\nQuickselect uses the same overall approach as quicksort, choosing one element as a pivot and partitioning the data in two based on the pivot, accordingly as less than or greater than the pivot. However, instead of recursing into both sides, as in quicksort, quickselect only recurses into one side – the side with the element it is searching for. This reduces the average complexity from O(n log n) to O(n), with a worst case of O(n2).\nAs with quicksort, quickselect is generally implemented as an in-place algorithm, and beyond selecting the k'th element, it also partially sorts the data. See selection algorithm for further discussion of the connection with sorting.\nSource: Wikipedia\nTabu\nTabu search uses a local or neighborhood search procedure to iteratively move from one potential solution {\\displaystyle x} x to an improved solution {\\displaystyle x'} x' in the neighborhood of {\\displaystyle x} x, until some stopping criterion has been satisfied (generally, an attempt limit or a score threshold). Local search procedures often become stuck in poor-scoring areas or areas where scores plateau. In order to avoid these pitfalls and explore regions of the search space that would be left unexplored by other local search procedures, tabu search carefully explores the neighborhood of each solution as the search progresses. The solutions admitted to the new neighborhood, {\\displaystyle N^{}(x)} N^(x), are determined through the use of memory structures. Using these memory structures, the search progresses by iteratively moving from the current solution {\\displaystyle x} x to an improved solution {\\displaystyle x'} x' in {\\displaystyle N^{}(x)} N^(x).\nThese memory structures form what is known as the tabu list, a set of rules and banned solutions used to filter which solutions will be admitted to the neighborhood {\\displaystyle N^{}(x)} N^(x) to be explored by the search. In its simplest form, a tabu list is a short-term set of the solutions that have been visited in the recent past (less than {\\displaystyle n} n iterations ago, where {\\displaystyle n} n is the number of previous solutions to be stored — is also called the tabu tenure). More commonly, a tabu list consists of solutions that have changed by the process of moving from one solution to another. It is convenient, for ease of description, to understand a “solution” to be coded and represented by such attributes.\nSource: Wikipedia\n\nCiphers\nCaesar\n![alt text][caesar]\nCaesar cipher, also known as Caesar's cipher, the shift cipher, Caesar's code or Caesar shift, is one of the simplest and most widely known encryption techniques.\nIt is a type of substitution cipher in which each letter in the plaintext is replaced by a letter some fixed number of positions down the alphabet. For example, with a left shift of 3, D would be replaced by A, E would become B, and so on. \nThe method is named after Julius Caesar, who used it in his private correspondence.\nThe encryption step performed by a Caesar cipher is often incorporated as part of more complex schemes, such as the Vigenère cipher, and still has modern application in the ROT13 system. As with all single-alphabet substitution ciphers, the Caesar cipher is easily broken and in modern practice offers essentially no communication security.\nSource: Wikipedia\nVigenère\nVigenère cipher is a method of encrypting alphabetic text by using a series of interwoven Caesar ciphers based on the letters of a keyword. It is a form of polyalphabetic substitution.\nThe Vigenère cipher has been reinvented many times. The method was originally described by Giovan Battista Bellaso in his 1553 book La cifra del. Sig. Giovan Battista Bellaso; however, the scheme was later misattributed to Blaise de Vigenère in the 19th century, and is now widely known as the \"Vigenère cipher\".\nThough the cipher is easy to understand and implement, for three centuries it resisted all attempts to break it; this earned it the description le chiffre indéchiffrable(French for 'the indecipherable cipher').\nMany people have tried to implement encryption schemes that are essentially Vigenère ciphers. Friedrich Kasiski was the first to publish a general method of deciphering a Vigenère cipher in 1863.\nSource: Wikipedia\nTransposition\nTransposition cipher is a method of encryption by which the positions held by units of plaintext (which are commonly characters or groups of characters) are shifted according to a regular system, so that the ciphertext constitutes a permutation of the plaintext. That is, the order of the units is changed (the plaintext is reordered).\nMathematically a bijective function is used on the characters' positions to encrypt and an inverse function to decrypt.\nSource: Wikipedia\nRSA (Rivest–Shamir–Adleman)\nRSA (Rivest–Shamir–Adleman) is one of the first public-key cryptosystems and is widely used for secure data transmission. In such a cryptosystem, the encryption key is public and it is different from the decryption key which is kept secret (private). In RSA, this asymmetry is based on the practical difficulty of the factorization of the product of two large prime numbers, the \"factoring problem\". The acronym RSA is made of the initial letters of the surnames of Ron Rivest, Adi Shamir, and Leonard Adleman, who first publicly described the algorithm in 1978. Clifford Cocks, an English mathematician working for the British intelligence agency Government Communications Headquarters (GCHQ), had developed an equivalent system in 1973, but this was not declassified until 1997.[1]\nA user of RSA creates and then publishes a public key based on two large prime numbers, along with an auxiliary value. The prime numbers must be kept secret. Anyone can use the public key to encrypt a message, but with currently published methods, and if the public key is large enough, only someone with knowledge of the prime numbers can decode the message feasibly.[2] Breaking RSA encryption is known as the RSA problem. Whether it is as difficult as the factoring problem remains an open question.\nSource: Wikipedia\nROT13\n\nROT13 (\"rotate by 13 places\", sometimes hyphenated ROT-13) is a simple letter substitution cipher that replaces a letter with the 13th letter after it, in the alphabet. ROT13 is a special case of the Caesar cipher which was developed in ancient Rome.\nBecause there are 26 letters (2×13) in the basic Latin alphabet, ROT13 is its own inverse; that is, to undo ROT13, the same algorithm is applied, so the same action can be used for encoding and decoding. The algorithm provides virtually no cryptographic security, and is often cited as a canonical example of weak encryption.[1]\nSource: Wikipedia\nXOR\nXOR cipher is a simple type of additive cipher,[1] an encryption algorithm that operates according to the principles:\nA {\\displaystyle \\oplus } \\oplus  0 = A,\nA {\\displaystyle \\oplus } \\oplus  A = 0,\n(A {\\displaystyle \\oplus } \\oplus  B) {\\displaystyle \\oplus } \\oplus  C = A {\\displaystyle \\oplus } \\oplus  (B {\\displaystyle \\oplus } \\oplus  C),\n(B {\\displaystyle \\oplus } \\oplus  A) {\\displaystyle \\oplus } \\oplus  A = B {\\displaystyle \\oplus } \\oplus  0 = B,\nwhere {\\displaystyle \\oplus } \\oplus  denotes the exclusive disjunction (XOR) operation. This operation is sometimes called modulus 2 addition (or subtraction, which is identical).[2] With this logic, a string of text can be encrypted by applying the bitwise XOR operator to every character using a given key. To decrypt the output, merely reapplying the XOR function with the key will remove the cipher.\nSource: Wikipedia\n"}, {"title": "hiroppy/fusuma", "language": "CSS", "content": "\n\n\n\n📝 Make slides with Markdown easily.\n\n\n\n\n\n\nJust write MarkDown and create cool slides.😎\nFeatures\n\nsupports WebSlides\nsupports Presentation API\n\nalso, it works even without Presentation API\n\n\nsupports various modes\n\ndevelopment\nproduction build\nexporting as PDF\ndeploying to GitHub Pages\n\n\nsupports SNS, OGP, FullScreen, and etc...\nsupports Presenter Mode\n\nyou can give a speech while watching a presenter's notes and a timer\n\n\ncustomizes JavaScript and CSS freely\n\nDemos\n\nintroduction slide of Fusuma [repository]\nothers [repository]\n\nYou can also try Fusuma in Gitpod, a one-click online IDE for GitHub:\n\nInstall\nNode versions > v8\n$ npm i fusuma --save-dev # or npm i fusuma -g\n\n# if you want to use yarn\n$ yarn add fusuma --dev\nProcedure\nJust execute the following three lines for executing, generating and deploying slides!\n$ npm i fusuma -D\n$ npx fusuma init\n$ mkdir slides && echo '# Hello😄' > slides/title.md\n\n# --- Tree ---\n$ tree -a\n.\n├── .fusumarc.yml\n└── slides\n    └── title.md\n\n1 directory, 2 files\n\n# --- executable tasks---\n$ npx fusuma start    # development\n$ npx fusuma build    # build as NODE_ENV=production\n$ npx fusuma deploy   # deploy to github pages\n$ npx fusuma pdf      # export as PDF from HTML\nWhen npx fusuma start is executed, fusuma will create a slide as follows and serves localhost:8080.\n\nAnd you can customize the slide using CSS.\nDirectory Structure\nPlease see samples/intro or Verification Repository.\nSlide order is numeric, alphabetical.\n.\n├── .fusumarc.yml       <-- the configuration file\n├── index.js            <-- optional for rewriting\n├── slides              <-- slides written by Markdown or HTML\n│   ├── 0-title.md\n│   ├── 01-content.md\n│   ├── 02-body\n│   │   └── 0-title.md\n│   └── 03-end.md\n└── style.css           <-- optional for rewriting\n\n2 directories, 7 files\n\nOr slides can be divided by --- like below.\n## Hello\n\nThis is the first slide.\n\n---\n\n## 🤭\n\nThis is the second slide.\nUsage\nFusuma provides CLI.\n   fusuma.js 1.0.0 - CLI for easily make slides with Markdown\n\n   USAGE\n\n     fusuma.js <command> [options]\n\n   COMMANDS\n\n     init                Create a configure file\n     start               Start with webpack-dev-server\n     build               Build with webpack\n     deploy              Deploy to GitHub pages\n     pdf                 Export as PDF\n     help <command>      Display help for a specific command\n\n   GLOBAL OPTIONS\n\n     -h, --help         Display help\n     -V, --version      Display version\n     --no-color         Disable colors\n     --quiet            Quiet mode - only displays warn and error messages\n     -v, --verbose      Verbose mode - will also output debug messages\nConfiguration File\nSupports for yaml and js and it can be generated by running fusuma init.\n.fusumarc.yml\n\nmeta:\n  url: https://slides.hiroppy.me\n  name: the present and future of JavaScript\n  author: Yuta Hiroto\n  description: Explain how specifications are determined and how it will be in the future.\n  thumbnail: https://avatars1.githubusercontent.com/u/1725583?v=4&s=200\n  siteName: slides.hiroppy.me\n  repositoryUrl: https://github.com/hiroppy/fusuma\n  sns:\n    - twitter\n    - hatena\nslide:\n  loop: true\n  sidebar: true\n  targetBlank: true\n  showIndex: false\n  isVertical: false\nextends:\n  js: index.js\n  css: style.css\n\n.fusumarc.js\n\nmodule.exports = {\n  meta: {\n    url: 'https://slide.hiroppy.me',\n    name: 'test-test',\n    author: 'hiroppy',\n    description: 'test',\n    thumbnail: 'url',\n    siteName: 'siteName',\n    sns: ['twitter', 'hatena'],\n    repositoryUrl: 'https://github.com/hiroppy/fusuma'\n  },\n  slide: {\n    loop: true,\n    sidebar: true,\n    targetBlank: true,\n    showIndex: false,\n    isVertical: false\n  },\n  extends: {\n    js: 'index.js',\n    css: 'style.css'\n  }\n};\n\nSlide Syntax\nSee the example slide:) Syntax Provided by Fusuma\nPresenter Mode\n\nopen Sidebar(click the bottom right button(三))\nclick the PC monitor icon\nif you use Chrome, you can choose select cast device\nif you use a browser that does not support Presentation API, a new window will be created\n\n\nAPI\nconst { start, build, deploy, pdf } = require('fusuma');\n"}, {"title": "CyC2018/CS-Notes", "language": "Java", "content": "\n离线阅读版本下载\n\n\n\n\n\n 算法 \n操作系统\n 网络 \n面向对象\n  数据库  \n   Java   \n系统设计\n   工具   \n编码实践\n   后记   \n\n\n\n\n✏️\n💻\n☁️\n🎨\n💾\n☕️\n💡\n🔧\n🍉\n📝\n\n\n\n\n\n\n\n   \n \n\n✏️ 算法\n\n剑指 Offer 题解\nLeetcode 题解\n算法\n\n💻 操作系统\n\n计算机操作系统\nLinux\n\n☁️ 网络\n\n计算机网络\nHTTP\nSocket\n\n🎨 面向对象\n\n设计模式\n面向对象思想\n\n💾 数据库\n\n数据库系统原理\nSQL\nLeetcode-Database 题解\nMySQL\nRedis\n\n☕️ Java\n\nJava 基础\nJava 容器\nJava 并发\nJava 虚拟机\nJava I/O\n\n💡 系统设计\n\n系统设计基础\n分布式\n集群\n攻击技术\n缓存\n消息队列\n\n🔧 工具\n\nGit\nDocker\n构建工具\n正则表达式\n\n🍉 编码实践\n\n代码可读性\n代码风格规范\n\n📝 后记\n公众号\n更多精彩内容将发布在公众号 CyC2018，公众号提供了该项目的离线阅读版本，后台回复 \"下载\" 即可领取。也提供了一份技术面试复习思维导图，不仅系统整理了面试知识点，而且标注了各个知识点的重要程度，从而帮你理清多而杂的面试知识点，后台回复 \"资料\" 即可领取。我基本是按照这个思维导图来进行复习的，对我拿到了 BAT 头条等 Offer 起到很大的帮助。你们完全可以和我一样根据思维导图上列的知识点来进行复习，就不用看很多不重要的内容，也可以知道哪些内容很重要从而多安排一些复习时间。\n\nQQ 群\n为大家提供一个学习交流平台，在这里你可以自由地讨论技术问题。\n\n后端面试进阶指南\n\n\n内推信息\nJob-Recommend\n绘图工具\ndraw.io\nGithub Page\ndocsify\nLogo\nPower by logomakr.\n排版\n笔记内容按照 中文文案排版指北 进行排版，以保证内容的可读性。\n不使用 ![]() 这种方式来引用图片，而是用 <img> 标签。一方面是为了能够控制图片以合适的大小显示，另一方面是因为 GFM 不支持 <center> ![]() </center> 这种方法让图片居中显示，只能使用 <div align=\"center\"> <img src=\"\"/> </div> 达到居中的效果。\n在线排版工具：Text-Typesetting。\n上传方案\n为了方便将本地笔记内容上传到 Github 上，实现了一整套自动化上传方案，包括提取图片、Markdown 文档转换、Git 同步。进行 Markdown 文档转换是因为 Github 使用的 GFM 不支持 MathJax 公式和 TOC 标记，所以需要替换 MathJax 公式为 CodeCogs 的云服务和重新生成 TOC 目录。\nGFM 转换工具：GFM-Converter。\nLicense\n本仓库内容 不是 将网上的资料随意拼凑而来，除了少部分引用书上和技术文档的原文，其余都是我的原创。在您引用本仓库内容或者对内容进行修改演绎时，请署名并以相同方式共享，谢谢。\n转载文章请在开头明显处标明该页面地址。如果是公众号转载，也请在合适的位置贴上 CyC2018 公众号二维码海报。\n\n致谢\n感谢以下人员对本仓库做出的贡献，当然不仅仅只有这些贡献者，这里就不一一列举了。如果你希望被添加到这个名单中，并且提交过 Issue 或者 PR，请与我联系。\n\n​    \n\n\n​    \n\n\n​    \n\n\n​    \n\n\n​    \n\n\n​    \n\n\n​    \n\n\n​    \n\n\n​    \n\n\n​    \n\n\n​    \n\n\n​    \n\n"}, {"title": "jaywcjlove/linux-command", "language": "HTML", "content": "\n\n\n\n\nLinux Command\n \n550 多个 Linux 命令，内容包含 Linux 命令手册、详解、学习，值得收藏的 Linux 命令速查手册。请原谅我写了个爬虫，爬了他们家的数据 linuxde.net ，同时进行了编辑，增加了一些数据。对他们的辛勤劳动表示敬意，个人希望能本地离线搜索，不喜欢广告，希望得到干净漂亮的预览界面，业余和工作时间需要使用大量的命令，所以干了一件看似比较愚蠢的事情，在回头有空的时候估计能做一个App？，或者是命令行帮助工具？但目前还没有计划...\nWeb | Dash | Alfred | Krunner | Android | Mac/Win/Linux | Chrome Plugin\n开发使用\n可以通过 npm 安装 linux-command 包，包含所有命令的 markdown 文本，和一个索引文件。\nnpm install linux-command\nvar comm = require(\"linux-command\");\nconsole.log(\"---->\", comm.ls);\n\nvar alias = require(\"linux-command/command/alias.md\");\nconsole.log(\"---->\", alias); // markdown string\n你也可以通过 CDN 来访问索引数据，和对应的命令详细内容，我将更新内容定期发布版本，提供大家使用，UNPKG 带上版本号，将锁定版本访问，删除版本号请求数据，将会自动重定向最新版本。\n# 命令索引 JSON 数据\nhttps://unpkg.com/linux-command/dist/data.json\n# 对应命令详情（Markdown）数据\nhttps://unpkg.com/linux-command/command/<命令名称>.md\n你也可以通过 Github 的 Raw 来，获取最新的内容\n# 命令索引 JSON 数据\nhttps://raw.githubusercontent.com/jaywcjlove/linux-command/master/dist/data.json\n# 对应命令详情（Markdown）数据\nhttps://raw.githubusercontent.com/jaywcjlove/linux-command/master/command/<命令名称>.md \nChrome 插件\n可在源码仓库预览效果，Github下载 crx 文件安装 或者开源中国下载 crx 文件安装 也可通过 Chrome Web Store 下载：\n\n\nWeb 版本\nGithub Web | OSChina Web | Web 1\n扫描二维码移动端预览搜索，也可通过二维码下面链接地址打开使用。\n\n预览搜索：https://git.io/linux\n\nAlfred 版本\nAlfred 版本下载， 下图是界面效果。\n\nDash 版本\n由 @SHANG殇 提供的 Dash 版本 #91，可配合 alfred 玩耍，下载 linux-command.docset.zip 文件解压，点击安装即可。\n\n目录\n\nLinux命令分类\n\n文件管理 File Management\n文件传输 File Transfer\n文档编辑 File Editor\n备份压缩 File Compression\n系统管理 System Management\n系统设置 System Settings\n网络通讯 Network Communication\n磁盘管理 Disk Management\n磁盘维护 Disk Maintenance\n设备管理 Device Commands\n电子邮件与新闻组\n其他命令 Misc Commands\n\n\nNode调用\nLinux学习资源整理\n社区网站\n知识相关\n软件工具\n中国开源镜像站点\n游戏玩家发行版\n\nLinux命令分类\n这里存放Linux 命令大全并不全，你可以通过linux-command来搜索，它是把 command 目录里面搜集的命令，生成了静态HTML并提供预览以及索引搜索。\n文件传输\nbye、ftp、ftpcount、ftpshut、ftpwho、ncftp、tftp、uucico、uucp、uupick、uuto、scp\n备份压缩\nar、bunzip2、bzip2、bzip2recover、compress、cpio、dump、gunzip、gzexe、gzip、lha、restore、tar、unarj、unzip、zip、zipinfo\n文件管理\ndiff、diffstat、file、find、git、gitview、ln、locate、lsattr、mattrib、mc、mcopy、mdel、mdir、mktemp、mmove、mread、mren、mshowfat、mtools、mtoolstest、mv、od、paste、patch、rcp、rhmask、rm、slocate、split、tee、tmpwatch、touch、umask、whereis、which、cat、chattr、chgrp、chmod、chown、cksum、cmp、cp、cut、indent\n磁盘管理\ncd、df、dirs、du、edquota、eject、lndir、ls、mcd、mdeltree、mdu、mkdir、mlabel、mmd、mmount、mrd、mzip、pwd、quota、quotacheck、quotaoff、quotaon、repquota、rmdir、rmt、stat、tree、umount\n磁盘维护\nbadblocks、cfdisk、dd、e2fsck、ext2ed、fdisk、fsck.ext2、fsck、fsck.minix、fsconf、hdparm、losetup、mbadblocks、mformat、mkbootdisk、mkdosfs、mke2fs、mkfs.ext2、mkfs、mkfs.minix、mkfs.msdos、mkinitrd、mkisofs、mkswap、mpartition、sfdisk、swapoff、swapon、symlinks、sync\n系统设置\nalias、apmd、aumix、bind、chkconfig、chroot、clock、crontab、declare、depmod、dircolors、dmesg、enable、eval、export、fbset、grpconv、grpunconv、hwclock、insmod、kbdconfig、lilo、liloconfig、lsmod、minfo、mkkickstart、modinfo、modprobe、mouseconfig、ntsysv、passwd、pwconv、pwunconv、rdate、resize、rmmod、rpm、set、setconsole、setenv、setup、sndconfig、SVGAText Mode、timeconfig、ulimit、unalias、unset\n系统管理\nadduser、chfn、chsh、date、exit、finger、free、fwhois、gitps、groupdel、groupmod、halt、id、kill、last、lastb、login、logname、logout、logrotate、newgrp、nice、procinfo、ps、pstree、reboot、renice、rlogin、rsh、rwho、screen、shutdown、sliplogin、su、sudo、suspend、swatch、tload、top、uname、useradd、userconf、userdel、usermod、vlock、w、who、whoami、whois\n文档编辑\ncol、colrm、comm、csplit、ed、egrep、ex、fgrep、fmt、fold、grep、ispell、jed、joe、join、look、mtype、pico、rgrep、sed、sort、spell、tr、uniq、vi、wc\n网络通讯\ndip、getty、mingetty、ppp-off、smbd(samba daemon)、telnet、uulog、uustat、uux、cu、dnsconf、efax、httpd、ifconfig、mesg、minicom、nc、netconf、netconfig、netstat、ping、pppstats、samba、setserial、shapecfg(shaper configuration)、smbd(samba daemon)、statserial(status ofserial port)、talk、tcpdump、testparm(test parameter)、traceroute、tty(teletypewriter)、uuname、wall(write all)、write、ytalk、arpwatch、apachectl、smbclient(samba client)、pppsetup\n设备管理\ndumpkeys、loadkeys、MAKEDEV、rdev、setleds\n电子邮件与新闻组\narchive、ctlinnd、elm、getlist、inncheck、mail、mailconf、mailq、messages、metamail、mutt、nntpget、pine、slrn、X WINDOWS SYSTEM、reconfig、startx(start X Window)、Xconfigurator、XF86Setup、xlsatoms、xlsclients、xlsfonts\n其他命令\nyes\nLinux学习资源整理\n社区网站\n\nLinux中国 - 各种资讯、文章、技术\n实验楼 - 免费提供了Linux在线环境，不用在自己机子上装系统也可以学习Linux，超方便实用。\n鸟哥的linux私房菜 - 非常适合Linux入门初学者看的教程。\nLinux公社 - Linux相关的新闻、教程、主题、壁纸都有。\nLinux Today - Linux新闻资讯发布，Linux职业技术学习！。\n\n知识相关\n\nLinux思维导图整理\nLinux初学者进阶学习资源整理\nLinux 基础入门（新版）\n【译】Linux概念架构的理解 En\nLinux 守护进程的启动方法\nLinux编程之内存映射\nLinux知识点小结\n10大白帽黑客专用的 Linux 操作系统\n\n软件工具\n\n超赞的Linux软件 Github仓库Zh En\n程序员喜欢的9款最佳的Linux文件比较工具\n提高 Linux 开发效率的 5 个工具\n你要了解的11款面向Linux系统的一流备份实用工具\n16个很有用的在线工具\nAdobe软件的最佳替代品 原文在这里\n\nEvince (Adobe Acrobat Reader) 一个“支持多种文档格式的文档查看器”，可以查看PDF，还支持各种漫画书格式\nPixlr (Adobe Photoshop) 一个强大的图像编辑工具\nInkscape (Adobe Illustrator) 一个专业的矢量图形编辑器\nPinegrow Web Editor (Adobe Dreamweaver) 一个可视化编辑制作 HTML 网站\nScribus (Adobe InDesign) 一个开源电子杂志制作软件\nWebflow (Adobe Muse) 一款可以帮助用户不用编码就可以快速创建网站的谷歌浏览器插件。\nTupi (Adobe Animate) 一款可以创建HTML5动画的工具。\nBlack Magic Fusion (Adobe After Effects) 一款先进的合成软件，广泛应用于视觉特效、广电影视设计以及3D动画设计等领域。\n\n\n\n中国开源镜像站点\n\n阿里云开源镜像站：http://mirrors.aliyun.com/\n网易开源镜像站：http://mirrors.163.com/\n搜狐开源镜像站：http://mirrors.sohu.com/\n北京交通大学：http://mirror.bjtu.edu.cn/ <教育网荐>\n兰州大学：http://mirror.lzu.edu.cn/ <西北高校FTP搜索引擎>\n厦门大学：http://mirrors.xmu.edu.cn/\n上海交通大学：http://ftp.sjtu.edu.cn/\n清华大学：http://mirrors.tuna.tsinghua.edu.cn/\n\nhttp://mirrors6.tuna.tsinghua.edu.cn/\nhttp://mirrors4.tuna.tsinghua.edu.cn/\n\n\n中国科学技术大学：http://mirrors.ustc.edu.cn/\n\nhttp://ipv4.ustc.edu.cn/ <教育网、电信>\nhttp://ipv6.ustc.edu.cn/ <IPv6 only>\n\n\n东北大学：http://mirror.neu.edu.cn/\n浙江大学：http://mirrors.zju.edu.cn/\n东软信息学院：http://mirrors.neusoft.edu.cn/\n\n游戏玩家发行版\n面向游戏玩家的八款最佳 Linux 发行版，本文由开源中国整理，原文在这里。\n\nSteamOS 官方文档 镜像下载\nUbuntu GamePack 下载地址\nFedora – Games Spin 下载地址\nSparkyLinux – GameOver Edition 下载地址\nLakka 下载地址\nGame Drift Linux 下载地址\nSolus 下载地址\nManjaro Gaming Edition (mGAMe) 下载地址\n\n"}, {"title": "flutter/flutter", "language": "Dart", "content": "\n\n\nFlutter is Google's mobile app SDK for crafting high-quality native interfaces\non iOS and Android in record time. Flutter works with existing code, is used by\ndevelopers and organizations around the world, and is free and open source.\nDocumentation\n\nInstall Flutter\nFlutter documentation\nDevelopment wiki\nContributing to Flutter\n\nFor announcements about new releases and breaking changes, follow the\nflutter-announce@googlegroups.com\nmailing list.\nAbout Flutter\nWe think Flutter will help you create beautiful, fast apps, with a productive,\nextensible and open development model.\nBeautiful apps\nWe want to enable designers to deliver their full creative vision without being\nforced to water it down due to limitations of the underlying framework.\nFlutter's layered architecture gives you control over every pixel on the\nscreen, and its powerful compositing capabilities let you overlay and animate\ngraphics, video, text and controls without limitation. Flutter includes a full\nset of widgets that deliver pixel-perfect experiences on both\niOS and Android.\n\nFast apps\nFlutter is fast. It's powered by the same hardware-accelerated Skia 2D\ngraphics library that underpins Chrome and Android. We architected Flutter to\nsupport glitch-free, jank-free graphics at the native speed of your device.\nFlutter code is powered by the world-class Dart platform, which enables\ncompilation to native 32-bit and 64-bit ARM code for iOS and Android.\nProductive development\nFlutter offers stateful hot reload, allowing you to make changes to your code\nand see the results instantly without restarting your app or losing its state.\n\nExtensible and open model\nFlutter works with any development tool, but includes editor plug-ins for both\nVisual Studio Code and IntelliJ / Android Studio. Flutter provides\nthousands of packages to speed your development, regardless\nof your target platform. And accessing platform features is easy. Here is a\nsnippet from our interop example:\nFuture<void> getBatteryLevel() async {\n  var batteryLevel = 'unknown';\n  try {\n    int result = await methodChannel.invokeMethod('getBatteryLevel');\n    batteryLevel = 'Battery level: $result%';\n  } on PlatformException {\n    batteryLevel = 'Failed to get battery level.';\n  }\n  setState(() {\n    _batteryLevel = batteryLevel;\n  });\n}\nFlutter is a fully open source project, and we welcome contributions.\nInformation on how to get started can be found at our\ncontributor guide.\n"}, {"title": "996icu/996.ICU", "language": "Rust", "content": "996.ICU\nPlease note that there exists NO other official account, app or merchandise except for the official domain and this repository.\n\n中文版\n\nThe name 996.ICU refers to \"Work by '996', sick in ICU\", an ironic saying among Chinese developers, which means that by following the \"996\" work schedule, you are risking yourself getting into the ICU (Intensive Care Unit).\n\n\n\n\nRelated press coverage:\n\nRadiiChina: GitHub Protest Over Chinese Tech Companies’ “996” Culture Goes Viral\nFinancial Times: China tech worker protest against long working hours goes viral\nWired: How github is helping overworked Chinese programmers\n\nSee a full list of press\nWhat is 996?\nA \"996\" work schedule refers to an unofficial work schedule (9 a.m.–9 p.m., 6 days per week) that has been gaining popularity. Serving a company that encourages the \"996\" work schedule usually means working for at least 60 hours per week.\nVisit 996 working hour system on Wikipedia for more details.\nWhat can I do?\n\nUpdate this list with evidence to help every worker.  Third party perfect list channel\nAdd this badge to your project to support 996.ICU.\nLicense your awesome projects with the Anti 996 License.\nAdd proposals to give advice about the development of 996.ICU.\nGo home at 6 pm without feeling sorry.\n\nVoices\nGovernment\n\nThe 996 shall disappear\n\nCapitalists\n\nJack Ma, founder of Alibaba: '996' is a huge blessing.\nRichard Liu, founder of JD.com: We will never force our employee to work as '996'.\nHowever, as a result many anonymous employees says that there is a list of departments which ranked them by overtime hours. The shortest will take punishments. And the leaders never leave evidences when ask employees to work as '996'.\nBai Ya, founder of Youzan: This will definitely be a right decision when we look back in a few years\n\nPrinciples and purposes\n\n\n996.ICU is an initiative initiated by IT practitioners. We welcome people from other fields and other countries to join the discussion.\n\n\nThis is not a political movement. We firmly uphold the labor law and request employers to respect the legitimate rights and interests of their employees.\n\n\nIt is great progress from closed source to open source, and it will also be great progress from open source to emphasizing labor rights at the same time. What we want is to create an open source software license that advocates workers' rights.\n\n\nWe are willing to hear all positive and constructive proposals and advocate mature and responsible speech.\n\n\nExpanding influence\nPlease feel free to translate 996.ICU's contents, adjust the format, add some contents or fix grammatical errors. Please note that adding too many translations is getting off the track.\nCommunity powers\n\n955.WLB is a repo that maintains a whitelist of 955 work-life balanced companies.\n996.LIST is a repo of a rank list of 996 companies and 955 companies.\n996.law This is a manual for workers who want to conduct labor arbitration and litigation on their own.\n996.YAOCL Yet Another Overtime Corps List, current another anonymous voting list.\n996.Leave encourages & introduces working overseas.\n996.RIP Old news never vanished.\n996.Petition initiates petitions by sending open letters to relevant government departments.\n996.action Supporters are encouraged to participate in public supervision.\n996.avengers adds 996ICU and 955WLB tags on recruitment websites.\n996.OD occupational diseases are the forewarning of ICU.\nsupport.996.ICU Microsoft and GitHub Workers Support 996.ICU\n\nWhere are the issues?\nEven with interaction limits on, the issues area was totally out of control.\nSo I personally decided to switch it off, not by GitHub or others.\nLicense\nAnti-996 License\n\n\nThe purpose of this license is to prevent anti-labour-law companies from using the software or codes under the license, and force those companies to weigh their way of working\n\n\nSee a full list of projects under Anti-996 License\n\n\nThis draft is adapted from the MIT license. For a more detailed explanation, please see Wiki. This license is designed to be compatible with all major open source licenses.\n\n\nFor law professionals or anyone who is willing to contribute to future version directly, please go to Anti-996-License-1.0. Thank you.\n\n\nContact\nYou can reach me by E-mail if you need.\n"}, {"title": "STVIR/pysot", "language": "Rust", "content": "996.ICU\nPlease note that there exists NO other official account, app or merchandise except for the official domain and this repository.\n\n中文版\n\nThe name 996.ICU refers to \"Work by '996', sick in ICU\", an ironic saying among Chinese developers, which means that by following the \"996\" work schedule, you are risking yourself getting into the ICU (Intensive Care Unit).\n\n\n\n\nRelated press coverage:\n\nRadiiChina: GitHub Protest Over Chinese Tech Companies’ “996” Culture Goes Viral\nFinancial Times: China tech worker protest against long working hours goes viral\nWired: How github is helping overworked Chinese programmers\n\nSee a full list of press\nWhat is 996?\nA \"996\" work schedule refers to an unofficial work schedule (9 a.m.–9 p.m., 6 days per week) that has been gaining popularity. Serving a company that encourages the \"996\" work schedule usually means working for at least 60 hours per week.\nVisit 996 working hour system on Wikipedia for more details.\nWhat can I do?\n\nUpdate this list with evidence to help every worker.  Third party perfect list channel\nAdd this badge to your project to support 996.ICU.\nLicense your awesome projects with the Anti 996 License.\nAdd proposals to give advice about the development of 996.ICU.\nGo home at 6 pm without feeling sorry.\n\nVoices\nGovernment\n\nThe 996 shall disappear\n\nCapitalists\n\nJack Ma, founder of Alibaba: '996' is a huge blessing.\nRichard Liu, founder of JD.com: We will never force our employee to work as '996'.\nHowever, as a result many anonymous employees says that there is a list of departments which ranked them by overtime hours. The shortest will take punishments. And the leaders never leave evidences when ask employees to work as '996'.\nBai Ya, founder of Youzan: This will definitely be a right decision when we look back in a few years\n\nPrinciples and purposes\n\n\n996.ICU is an initiative initiated by IT practitioners. We welcome people from other fields and other countries to join the discussion.\n\n\nThis is not a political movement. We firmly uphold the labor law and request employers to respect the legitimate rights and interests of their employees.\n\n\nIt is great progress from closed source to open source, and it will also be great progress from open source to emphasizing labor rights at the same time. What we want is to create an open source software license that advocates workers' rights.\n\n\nWe are willing to hear all positive and constructive proposals and advocate mature and responsible speech.\n\n\nExpanding influence\nPlease feel free to translate 996.ICU's contents, adjust the format, add some contents or fix grammatical errors. Please note that adding too many translations is getting off the track.\nCommunity powers\n\n955.WLB is a repo that maintains a whitelist of 955 work-life balanced companies.\n996.LIST is a repo of a rank list of 996 companies and 955 companies.\n996.law This is a manual for workers who want to conduct labor arbitration and litigation on their own.\n996.YAOCL Yet Another Overtime Corps List, current another anonymous voting list.\n996.Leave encourages & introduces working overseas.\n996.RIP Old news never vanished.\n996.Petition initiates petitions by sending open letters to relevant government departments.\n996.action Supporters are encouraged to participate in public supervision.\n996.avengers adds 996ICU and 955WLB tags on recruitment websites.\n996.OD occupational diseases are the forewarning of ICU.\nsupport.996.ICU Microsoft and GitHub Workers Support 996.ICU\n\nWhere are the issues?\nEven with interaction limits on, the issues area was totally out of control.\nSo I personally decided to switch it off, not by GitHub or others.\nLicense\nAnti-996 License\n\n\nThe purpose of this license is to prevent anti-labour-law companies from using the software or codes under the license, and force those companies to weigh their way of working\n\n\nSee a full list of projects under Anti-996 License\n\n\nThis draft is adapted from the MIT license. For a more detailed explanation, please see Wiki. This license is designed to be compatible with all major open source licenses.\n\n\nFor law professionals or anyone who is willing to contribute to future version directly, please go to Anti-996-License-1.0. Thank you.\n\n\nContact\nYou can reach me by E-mail if you need.\n"}, {"title": "minamarkham/formation", "language": "Rust", "content": "996.ICU\nPlease note that there exists NO other official account, app or merchandise except for the official domain and this repository.\n\n中文版\n\nThe name 996.ICU refers to \"Work by '996', sick in ICU\", an ironic saying among Chinese developers, which means that by following the \"996\" work schedule, you are risking yourself getting into the ICU (Intensive Care Unit).\n\n\n\n\nRelated press coverage:\n\nRadiiChina: GitHub Protest Over Chinese Tech Companies’ “996” Culture Goes Viral\nFinancial Times: China tech worker protest against long working hours goes viral\nWired: How github is helping overworked Chinese programmers\n\nSee a full list of press\nWhat is 996?\nA \"996\" work schedule refers to an unofficial work schedule (9 a.m.–9 p.m., 6 days per week) that has been gaining popularity. Serving a company that encourages the \"996\" work schedule usually means working for at least 60 hours per week.\nVisit 996 working hour system on Wikipedia for more details.\nWhat can I do?\n\nUpdate this list with evidence to help every worker.  Third party perfect list channel\nAdd this badge to your project to support 996.ICU.\nLicense your awesome projects with the Anti 996 License.\nAdd proposals to give advice about the development of 996.ICU.\nGo home at 6 pm without feeling sorry.\n\nVoices\nGovernment\n\nThe 996 shall disappear\n\nCapitalists\n\nJack Ma, founder of Alibaba: '996' is a huge blessing.\nRichard Liu, founder of JD.com: We will never force our employee to work as '996'.\nHowever, as a result many anonymous employees says that there is a list of departments which ranked them by overtime hours. The shortest will take punishments. And the leaders never leave evidences when ask employees to work as '996'.\nBai Ya, founder of Youzan: This will definitely be a right decision when we look back in a few years\n\nPrinciples and purposes\n\n\n996.ICU is an initiative initiated by IT practitioners. We welcome people from other fields and other countries to join the discussion.\n\n\nThis is not a political movement. We firmly uphold the labor law and request employers to respect the legitimate rights and interests of their employees.\n\n\nIt is great progress from closed source to open source, and it will also be great progress from open source to emphasizing labor rights at the same time. What we want is to create an open source software license that advocates workers' rights.\n\n\nWe are willing to hear all positive and constructive proposals and advocate mature and responsible speech.\n\n\nExpanding influence\nPlease feel free to translate 996.ICU's contents, adjust the format, add some contents or fix grammatical errors. Please note that adding too many translations is getting off the track.\nCommunity powers\n\n955.WLB is a repo that maintains a whitelist of 955 work-life balanced companies.\n996.LIST is a repo of a rank list of 996 companies and 955 companies.\n996.law This is a manual for workers who want to conduct labor arbitration and litigation on their own.\n996.YAOCL Yet Another Overtime Corps List, current another anonymous voting list.\n996.Leave encourages & introduces working overseas.\n996.RIP Old news never vanished.\n996.Petition initiates petitions by sending open letters to relevant government departments.\n996.action Supporters are encouraged to participate in public supervision.\n996.avengers adds 996ICU and 955WLB tags on recruitment websites.\n996.OD occupational diseases are the forewarning of ICU.\nsupport.996.ICU Microsoft and GitHub Workers Support 996.ICU\n\nWhere are the issues?\nEven with interaction limits on, the issues area was totally out of control.\nSo I personally decided to switch it off, not by GitHub or others.\nLicense\nAnti-996 License\n\n\nThe purpose of this license is to prevent anti-labour-law companies from using the software or codes under the license, and force those companies to weigh their way of working\n\n\nSee a full list of projects under Anti-996 License\n\n\nThis draft is adapted from the MIT license. For a more detailed explanation, please see Wiki. This license is designed to be compatible with all major open source licenses.\n\n\nFor law professionals or anyone who is willing to contribute to future version directly, please go to Anti-996-License-1.0. Thank you.\n\n\nContact\nYou can reach me by E-mail if you need.\n"}, {"title": "azl397985856/leetcode", "language": "Rust", "content": "996.ICU\nPlease note that there exists NO other official account, app or merchandise except for the official domain and this repository.\n\n中文版\n\nThe name 996.ICU refers to \"Work by '996', sick in ICU\", an ironic saying among Chinese developers, which means that by following the \"996\" work schedule, you are risking yourself getting into the ICU (Intensive Care Unit).\n\n\n\n\nRelated press coverage:\n\nRadiiChina: GitHub Protest Over Chinese Tech Companies’ “996” Culture Goes Viral\nFinancial Times: China tech worker protest against long working hours goes viral\nWired: How github is helping overworked Chinese programmers\n\nSee a full list of press\nWhat is 996?\nA \"996\" work schedule refers to an unofficial work schedule (9 a.m.–9 p.m., 6 days per week) that has been gaining popularity. Serving a company that encourages the \"996\" work schedule usually means working for at least 60 hours per week.\nVisit 996 working hour system on Wikipedia for more details.\nWhat can I do?\n\nUpdate this list with evidence to help every worker.  Third party perfect list channel\nAdd this badge to your project to support 996.ICU.\nLicense your awesome projects with the Anti 996 License.\nAdd proposals to give advice about the development of 996.ICU.\nGo home at 6 pm without feeling sorry.\n\nVoices\nGovernment\n\nThe 996 shall disappear\n\nCapitalists\n\nJack Ma, founder of Alibaba: '996' is a huge blessing.\nRichard Liu, founder of JD.com: We will never force our employee to work as '996'.\nHowever, as a result many anonymous employees says that there is a list of departments which ranked them by overtime hours. The shortest will take punishments. And the leaders never leave evidences when ask employees to work as '996'.\nBai Ya, founder of Youzan: This will definitely be a right decision when we look back in a few years\n\nPrinciples and purposes\n\n\n996.ICU is an initiative initiated by IT practitioners. We welcome people from other fields and other countries to join the discussion.\n\n\nThis is not a political movement. We firmly uphold the labor law and request employers to respect the legitimate rights and interests of their employees.\n\n\nIt is great progress from closed source to open source, and it will also be great progress from open source to emphasizing labor rights at the same time. What we want is to create an open source software license that advocates workers' rights.\n\n\nWe are willing to hear all positive and constructive proposals and advocate mature and responsible speech.\n\n\nExpanding influence\nPlease feel free to translate 996.ICU's contents, adjust the format, add some contents or fix grammatical errors. Please note that adding too many translations is getting off the track.\nCommunity powers\n\n955.WLB is a repo that maintains a whitelist of 955 work-life balanced companies.\n996.LIST is a repo of a rank list of 996 companies and 955 companies.\n996.law This is a manual for workers who want to conduct labor arbitration and litigation on their own.\n996.YAOCL Yet Another Overtime Corps List, current another anonymous voting list.\n996.Leave encourages & introduces working overseas.\n996.RIP Old news never vanished.\n996.Petition initiates petitions by sending open letters to relevant government departments.\n996.action Supporters are encouraged to participate in public supervision.\n996.avengers adds 996ICU and 955WLB tags on recruitment websites.\n996.OD occupational diseases are the forewarning of ICU.\nsupport.996.ICU Microsoft and GitHub Workers Support 996.ICU\n\nWhere are the issues?\nEven with interaction limits on, the issues area was totally out of control.\nSo I personally decided to switch it off, not by GitHub or others.\nLicense\nAnti-996 License\n\n\nThe purpose of this license is to prevent anti-labour-law companies from using the software or codes under the license, and force those companies to weigh their way of working\n\n\nSee a full list of projects under Anti-996 License\n\n\nThis draft is adapted from the MIT license. For a more detailed explanation, please see Wiki. This license is designed to be compatible with all major open source licenses.\n\n\nFor law professionals or anyone who is willing to contribute to future version directly, please go to Anti-996-License-1.0. Thank you.\n\n\nContact\nYou can reach me by E-mail if you need.\n"}, {"title": "qianguyihao/Web", "language": "Rust", "content": "996.ICU\nPlease note that there exists NO other official account, app or merchandise except for the official domain and this repository.\n\n中文版\n\nThe name 996.ICU refers to \"Work by '996', sick in ICU\", an ironic saying among Chinese developers, which means that by following the \"996\" work schedule, you are risking yourself getting into the ICU (Intensive Care Unit).\n\n\n\n\nRelated press coverage:\n\nRadiiChina: GitHub Protest Over Chinese Tech Companies’ “996” Culture Goes Viral\nFinancial Times: China tech worker protest against long working hours goes viral\nWired: How github is helping overworked Chinese programmers\n\nSee a full list of press\nWhat is 996?\nA \"996\" work schedule refers to an unofficial work schedule (9 a.m.–9 p.m., 6 days per week) that has been gaining popularity. Serving a company that encourages the \"996\" work schedule usually means working for at least 60 hours per week.\nVisit 996 working hour system on Wikipedia for more details.\nWhat can I do?\n\nUpdate this list with evidence to help every worker.  Third party perfect list channel\nAdd this badge to your project to support 996.ICU.\nLicense your awesome projects with the Anti 996 License.\nAdd proposals to give advice about the development of 996.ICU.\nGo home at 6 pm without feeling sorry.\n\nVoices\nGovernment\n\nThe 996 shall disappear\n\nCapitalists\n\nJack Ma, founder of Alibaba: '996' is a huge blessing.\nRichard Liu, founder of JD.com: We will never force our employee to work as '996'.\nHowever, as a result many anonymous employees says that there is a list of departments which ranked them by overtime hours. The shortest will take punishments. And the leaders never leave evidences when ask employees to work as '996'.\nBai Ya, founder of Youzan: This will definitely be a right decision when we look back in a few years\n\nPrinciples and purposes\n\n\n996.ICU is an initiative initiated by IT practitioners. We welcome people from other fields and other countries to join the discussion.\n\n\nThis is not a political movement. We firmly uphold the labor law and request employers to respect the legitimate rights and interests of their employees.\n\n\nIt is great progress from closed source to open source, and it will also be great progress from open source to emphasizing labor rights at the same time. What we want is to create an open source software license that advocates workers' rights.\n\n\nWe are willing to hear all positive and constructive proposals and advocate mature and responsible speech.\n\n\nExpanding influence\nPlease feel free to translate 996.ICU's contents, adjust the format, add some contents or fix grammatical errors. Please note that adding too many translations is getting off the track.\nCommunity powers\n\n955.WLB is a repo that maintains a whitelist of 955 work-life balanced companies.\n996.LIST is a repo of a rank list of 996 companies and 955 companies.\n996.law This is a manual for workers who want to conduct labor arbitration and litigation on their own.\n996.YAOCL Yet Another Overtime Corps List, current another anonymous voting list.\n996.Leave encourages & introduces working overseas.\n996.RIP Old news never vanished.\n996.Petition initiates petitions by sending open letters to relevant government departments.\n996.action Supporters are encouraged to participate in public supervision.\n996.avengers adds 996ICU and 955WLB tags on recruitment websites.\n996.OD occupational diseases are the forewarning of ICU.\nsupport.996.ICU Microsoft and GitHub Workers Support 996.ICU\n\nWhere are the issues?\nEven with interaction limits on, the issues area was totally out of control.\nSo I personally decided to switch it off, not by GitHub or others.\nLicense\nAnti-996 License\n\n\nThe purpose of this license is to prevent anti-labour-law companies from using the software or codes under the license, and force those companies to weigh their way of working\n\n\nSee a full list of projects under Anti-996 License\n\n\nThis draft is adapted from the MIT license. For a more detailed explanation, please see Wiki. This license is designed to be compatible with all major open source licenses.\n\n\nFor law professionals or anyone who is willing to contribute to future version directly, please go to Anti-996-License-1.0. Thank you.\n\n\nContact\nYou can reach me by E-mail if you need.\n"}, {"title": "sql-machine-learning/sqlflow", "language": "Go", "content": "SQLFlow\n   \nWhat is SQLFlow?\nSQLFlow is a bridge that connects a SQL engine, e.g. MySQL, Hive, SparkSQL or SQL Server, with TensorFlow and other machine learning toolkits.  SQLFlow extends the SQL language to enable model training, prediction and inference.\nMotivation\nThe current experience of development ML based applications requires a team of data engineers, data scientists, business analysts as well as a proliferation of advanced languages and programming tools like Python, SQL, SAS, SASS, Julia, R. The fragmentation of tooling and development environment brings additional difficulties in engineering to model trainning/tunning. What if we marry the most widely used data management/processing language SQL with ML/system capabilities and let engineers with SQL skills develop advanced ML based applications?\nThere are already some work in progress in the industry. We can write simple machine learning prediction (or scoring) algorithms in SQL using operators like DOT_PRODUCT. However, this requires copy-n-pasting model parameters from the training program to SQL statements. In the commercial world, we see some proprietary SQL engines providing extensions to support machine learning capabilities.\n\nMicrosoft SQL Server: Microsoft SQL Server has the machine learning service that runs machine learning programs in R or Python as an external script.\nTeradata SQL for DL: Teradata also provides a RESTful service, which is callable from the extended SQL SELECT syntax.\nGoogle BigQuery: Google BigQuery enables machine learning in SQL by introducing the CREATE MODEL statement.\n\nNone of the existing solution solves our pain point, instead we want it to be fully extensible.\n\nThis solution should be compatible to many SQL engines, instead of a specific version or type.\nIt should support sophisticated machine learning models, including TensorFlow for deep learning and xgboost for trees.\nWe also want the flexibility to configure and run cutting-edge ML algorithms including specifying feature crosses, at least, no Python or R code embedded in the SQL statements, and fully integrated with hyperparameter estimation.\n\nQuick Overview\nHere are examples for training a Tensorflow DNNClassifer model using sample data Iris.train, and running prediction using the trained model. You can see how cool it is to write some elegant ML code using SQL:\nsqlflow> SELECT *\nFROM iris.train\nTRAIN DNNClassifier\nWITH n_classes = 3, hidden_units = [10, 20]\nCOLUMN sepal_length, sepal_width, petal_length, petal_width\nLABEL class\nINTO sqlflow_models.my_dnn_model;\n\n...\nTraining set accuracy: 0.96721\nDone training\nsqlflow> SELECT *\nFROM iris.test\nPREDICT iris.predict.class\nUSING sqlflow_models.my_dnn_model;\n\n...\nDone predicting. Predict table : iris.predict\nHow to use SQLFlow\n\nInstallation\nRunning a Demo\nExtended SQL Syntax\n\nContributions\n\nBuild from source code.\nThe walkthrough of the source code\nThe choice of parser generator\n\nRoadmap\nSQLFlow will love to support as many mainstream ML frameworks and data sources as possible, but we feel like the expansion would be hard to be done merely on our own, so we would love to hear your options on what ML frameworks and data sources you are currently using and build upon. Please refer to our roadmap for specific timelines, also let us know your current scenarios and interests around SQLFlow project so we can prioritize based on the feedback from the community.\nFeedback\nYour feedback is our motivation to move on. Please let us know your questions, concerns, and issues by filing Github Issues.\nLicense\nApache License 2.0\n"}, {"title": "dgryski/go-perfbook", "language": "Go", "content": "SQLFlow\n   \nWhat is SQLFlow?\nSQLFlow is a bridge that connects a SQL engine, e.g. MySQL, Hive, SparkSQL or SQL Server, with TensorFlow and other machine learning toolkits.  SQLFlow extends the SQL language to enable model training, prediction and inference.\nMotivation\nThe current experience of development ML based applications requires a team of data engineers, data scientists, business analysts as well as a proliferation of advanced languages and programming tools like Python, SQL, SAS, SASS, Julia, R. The fragmentation of tooling and development environment brings additional difficulties in engineering to model trainning/tunning. What if we marry the most widely used data management/processing language SQL with ML/system capabilities and let engineers with SQL skills develop advanced ML based applications?\nThere are already some work in progress in the industry. We can write simple machine learning prediction (or scoring) algorithms in SQL using operators like DOT_PRODUCT. However, this requires copy-n-pasting model parameters from the training program to SQL statements. In the commercial world, we see some proprietary SQL engines providing extensions to support machine learning capabilities.\n\nMicrosoft SQL Server: Microsoft SQL Server has the machine learning service that runs machine learning programs in R or Python as an external script.\nTeradata SQL for DL: Teradata also provides a RESTful service, which is callable from the extended SQL SELECT syntax.\nGoogle BigQuery: Google BigQuery enables machine learning in SQL by introducing the CREATE MODEL statement.\n\nNone of the existing solution solves our pain point, instead we want it to be fully extensible.\n\nThis solution should be compatible to many SQL engines, instead of a specific version or type.\nIt should support sophisticated machine learning models, including TensorFlow for deep learning and xgboost for trees.\nWe also want the flexibility to configure and run cutting-edge ML algorithms including specifying feature crosses, at least, no Python or R code embedded in the SQL statements, and fully integrated with hyperparameter estimation.\n\nQuick Overview\nHere are examples for training a Tensorflow DNNClassifer model using sample data Iris.train, and running prediction using the trained model. You can see how cool it is to write some elegant ML code using SQL:\nsqlflow> SELECT *\nFROM iris.train\nTRAIN DNNClassifier\nWITH n_classes = 3, hidden_units = [10, 20]\nCOLUMN sepal_length, sepal_width, petal_length, petal_width\nLABEL class\nINTO sqlflow_models.my_dnn_model;\n\n...\nTraining set accuracy: 0.96721\nDone training\nsqlflow> SELECT *\nFROM iris.test\nPREDICT iris.predict.class\nUSING sqlflow_models.my_dnn_model;\n\n...\nDone predicting. Predict table : iris.predict\nHow to use SQLFlow\n\nInstallation\nRunning a Demo\nExtended SQL Syntax\n\nContributions\n\nBuild from source code.\nThe walkthrough of the source code\nThe choice of parser generator\n\nRoadmap\nSQLFlow will love to support as many mainstream ML frameworks and data sources as possible, but we feel like the expansion would be hard to be done merely on our own, so we would love to hear your options on what ML frameworks and data sources you are currently using and build upon. Please refer to our roadmap for specific timelines, also let us know your current scenarios and interests around SQLFlow project so we can prioritize based on the feedback from the community.\nFeedback\nYour feedback is our motivation to move on. Please let us know your questions, concerns, and issues by filing Github Issues.\nLicense\nApache License 2.0\n"}, {"title": "Snailclimb/JavaGuide", "language": "Go", "content": "SQLFlow\n   \nWhat is SQLFlow?\nSQLFlow is a bridge that connects a SQL engine, e.g. MySQL, Hive, SparkSQL or SQL Server, with TensorFlow and other machine learning toolkits.  SQLFlow extends the SQL language to enable model training, prediction and inference.\nMotivation\nThe current experience of development ML based applications requires a team of data engineers, data scientists, business analysts as well as a proliferation of advanced languages and programming tools like Python, SQL, SAS, SASS, Julia, R. The fragmentation of tooling and development environment brings additional difficulties in engineering to model trainning/tunning. What if we marry the most widely used data management/processing language SQL with ML/system capabilities and let engineers with SQL skills develop advanced ML based applications?\nThere are already some work in progress in the industry. We can write simple machine learning prediction (or scoring) algorithms in SQL using operators like DOT_PRODUCT. However, this requires copy-n-pasting model parameters from the training program to SQL statements. In the commercial world, we see some proprietary SQL engines providing extensions to support machine learning capabilities.\n\nMicrosoft SQL Server: Microsoft SQL Server has the machine learning service that runs machine learning programs in R or Python as an external script.\nTeradata SQL for DL: Teradata also provides a RESTful service, which is callable from the extended SQL SELECT syntax.\nGoogle BigQuery: Google BigQuery enables machine learning in SQL by introducing the CREATE MODEL statement.\n\nNone of the existing solution solves our pain point, instead we want it to be fully extensible.\n\nThis solution should be compatible to many SQL engines, instead of a specific version or type.\nIt should support sophisticated machine learning models, including TensorFlow for deep learning and xgboost for trees.\nWe also want the flexibility to configure and run cutting-edge ML algorithms including specifying feature crosses, at least, no Python or R code embedded in the SQL statements, and fully integrated with hyperparameter estimation.\n\nQuick Overview\nHere are examples for training a Tensorflow DNNClassifer model using sample data Iris.train, and running prediction using the trained model. You can see how cool it is to write some elegant ML code using SQL:\nsqlflow> SELECT *\nFROM iris.train\nTRAIN DNNClassifier\nWITH n_classes = 3, hidden_units = [10, 20]\nCOLUMN sepal_length, sepal_width, petal_length, petal_width\nLABEL class\nINTO sqlflow_models.my_dnn_model;\n\n...\nTraining set accuracy: 0.96721\nDone training\nsqlflow> SELECT *\nFROM iris.test\nPREDICT iris.predict.class\nUSING sqlflow_models.my_dnn_model;\n\n...\nDone predicting. Predict table : iris.predict\nHow to use SQLFlow\n\nInstallation\nRunning a Demo\nExtended SQL Syntax\n\nContributions\n\nBuild from source code.\nThe walkthrough of the source code\nThe choice of parser generator\n\nRoadmap\nSQLFlow will love to support as many mainstream ML frameworks and data sources as possible, but we feel like the expansion would be hard to be done merely on our own, so we would love to hear your options on what ML frameworks and data sources you are currently using and build upon. Please refer to our roadmap for specific timelines, also let us know your current scenarios and interests around SQLFlow project so we can prioritize based on the feedback from the community.\nFeedback\nYour feedback is our motivation to move on. Please let us know your questions, concerns, and issues by filing Github Issues.\nLicense\nApache License 2.0\n"}, {"title": "microsoft/vscode", "language": "TypeScript", "content": "Visual Studio Code - Open Source\n\n\n\n\nVS Code is a type of tool that combines the simplicity of\na code editor with what developers need for their core edit-build-debug cycle. It provides comprehensive editing and debugging support, an extensibility model, and lightweight integration with existing tools.\nVS Code is updated monthly with new features and bug fixes. You can download it for Windows, macOS, and Linux on VS Code's website. To get the latest releases every day, you can install the Insiders version of VS Code. This builds from the master branch and is updated daily at the very least.\n\n\n\nThe vscode repository is where VS Code is developed and there are many ways in which you can participate in the project, for example:\n\nSubmit bugs and feature requests and help us verify as they are checked in.\nReview source code changes.\nReview the documentation and make pull requests for anything from typos to new content.\n\nContributing\nIf you are interested in fixing issues and contributing directly to the code base,\nplease see the document How to Contribute, which covers the following:\n\nHow to build and run from source\nThe development workflow, including debugging and running tests\nCoding Guidelines\nSubmitting pull requests\nContributing to translations\n\nPlease also see our Code of Conduct.\nFeedback\n\nAsk a question on Stack Overflow.\nRequest a new feature on GitHub.\nVote for Popular Feature Requests.\nFile a bug in GitHub Issues.\nTweet us with any other feedback.\n\nRelated Projects\nMany of the core components and extensions to Code live in their own repositories on GitHub. For example, the node debug adapter and the mono debug adapter have their own repositories.\nFor a complete list, please visit the Related Projects page on our wiki.\nBundled Extensions\nCode ships with a set of extensions. These extensions are located in the extensions folder.\nThese extensions include grammars and snippets for several languages. Extensions that provide rich language support (code completion, go to definition) for a language have the suffix 'language-features'. For example, the 'json' extension provides coloring for JSON and the 'json-language-features' provides rich language support for JSON.\nLicense\nCopyright (c) Microsoft Corporation. All rights reserved.\nLicensed under the MIT License.\n"}, {"title": "markphelps/flipt", "language": "Go", "content": "\n\n\nA feature flag solution that runs in your existing infrastructure\n\n\n\n\n\n\n\n\nDocumentation\nhttps://flipt.dev/\nWhat is Flipt\nFlipt is an open source feature flag application that allows you to run experiments across services in your environment.\nThis means that you can deploy Flipt within your existing infrastructure and not have to worry about your information being sent to a third party or the latency required to communicate across the internet.\nFlipt includes native client SDKs as well as a REST API so you can choose how to best integrate Flipt with your applications.\nFlipt Features\nFlipt enables you to add feature flag support to your existing applications, with a simple, single UI and API.\nThis can range from simple on/off feature flags to more advanced use cases where you want to be able to rollout different versions of a feature to percentages of your users.\nFlipt features include:\n\nFast. Written in Go. Optimized for performance\nStand alone, easy to run server with no external dependencies\nAbility to create advanced distribution rules to target segments of users\nNative GRPC client SDKs to integrate with your applications\nSimple REST API\nModern UI and debug console\n\nWhy Flipt\nFlipt allows you to focus on building your applications without having to worry about implementing your own feature flag solution that works across your infrastructure.\nOn top of this, Flipt provides a nice, modern UI so that you can always monitor the state of your feature flags and experiments in a single place.\nRunning Flipt\nFlipt is a single, self contained binary that you run on your own servers or cloud infrastructure. There are a multitude of benefits to running Flipt yourself, including:\n\n🔒 Security - No data leaves your servers and you don't have to open your systems to the outside world to communicate with Flipt. It all runs within your existing infrastructure.\n🚀 Speed - Since Flipt is co-located with your existing services, you do not have to communicate across the internet to another application running on the other side of the world which can add excessive latency and slow down your applications.\n✅ Simplicity - Flipt is a single binary with no external dependencies. This means there is no database server to manage or connect to, no clusters to configure, and data backup is as simple as copying a single file.\n\nTry It\n❯ docker run --rm -p 8080:8080 -p 9000:9000 markphelps/flipt:latest\nFlipt UI will now be reachable at http://localhost:8080/.\nFor more permanent methods of running Flipt, see the Installation section.\nLicensing\nThere are currently two types of licenses in place for Flipt:\n\nClient License\nServer License\n\nClient License\nAll of the code required to generate GRPC clients in other languages as well as the existing GRPC Go client are licensed under the MIT License.\nThis code exists in the rpc/ directory.\nThe client code is the code that you would integrate into your applications, which is why a more permissive license is used.\nServer License\nThe server code is licensed under the GPL 3.0 License.\nIf there are any concerns about the use of this license for the server, please open an issue on GitHub so that we can discuss publicly.\nAuthor\n\nWebsite: https://markphelps.me\nTwitter: @mark_a_phelps\nEmail: mark.aaron.phelps at gmail.com\n\nContributing\nI would love your help! Before submitting a PR, please read over the Contributing guide.\nPro Version\nMy plan is to soon start working on a Pro Version of Flipt for enterprise. Along with support, some of the planned features include:\n\nUser management/permissions\nMultiple environments\nAudit log\nStreaming updates\nMetrics\nHA support\n\nIf you or your organization would like to help beta test a Pro version of Flipt, please get in touch with me:\n\nTwitter: @mark_a_phelps\nEmail: mark.aaron.phelps at gmail.com\n\n"}, {"title": "teoga/awesome-product-design", "language": "Go", "content": "\n\n\nA feature flag solution that runs in your existing infrastructure\n\n\n\n\n\n\n\n\nDocumentation\nhttps://flipt.dev/\nWhat is Flipt\nFlipt is an open source feature flag application that allows you to run experiments across services in your environment.\nThis means that you can deploy Flipt within your existing infrastructure and not have to worry about your information being sent to a third party or the latency required to communicate across the internet.\nFlipt includes native client SDKs as well as a REST API so you can choose how to best integrate Flipt with your applications.\nFlipt Features\nFlipt enables you to add feature flag support to your existing applications, with a simple, single UI and API.\nThis can range from simple on/off feature flags to more advanced use cases where you want to be able to rollout different versions of a feature to percentages of your users.\nFlipt features include:\n\nFast. Written in Go. Optimized for performance\nStand alone, easy to run server with no external dependencies\nAbility to create advanced distribution rules to target segments of users\nNative GRPC client SDKs to integrate with your applications\nSimple REST API\nModern UI and debug console\n\nWhy Flipt\nFlipt allows you to focus on building your applications without having to worry about implementing your own feature flag solution that works across your infrastructure.\nOn top of this, Flipt provides a nice, modern UI so that you can always monitor the state of your feature flags and experiments in a single place.\nRunning Flipt\nFlipt is a single, self contained binary that you run on your own servers or cloud infrastructure. There are a multitude of benefits to running Flipt yourself, including:\n\n🔒 Security - No data leaves your servers and you don't have to open your systems to the outside world to communicate with Flipt. It all runs within your existing infrastructure.\n🚀 Speed - Since Flipt is co-located with your existing services, you do not have to communicate across the internet to another application running on the other side of the world which can add excessive latency and slow down your applications.\n✅ Simplicity - Flipt is a single binary with no external dependencies. This means there is no database server to manage or connect to, no clusters to configure, and data backup is as simple as copying a single file.\n\nTry It\n❯ docker run --rm -p 8080:8080 -p 9000:9000 markphelps/flipt:latest\nFlipt UI will now be reachable at http://localhost:8080/.\nFor more permanent methods of running Flipt, see the Installation section.\nLicensing\nThere are currently two types of licenses in place for Flipt:\n\nClient License\nServer License\n\nClient License\nAll of the code required to generate GRPC clients in other languages as well as the existing GRPC Go client are licensed under the MIT License.\nThis code exists in the rpc/ directory.\nThe client code is the code that you would integrate into your applications, which is why a more permissive license is used.\nServer License\nThe server code is licensed under the GPL 3.0 License.\nIf there are any concerns about the use of this license for the server, please open an issue on GitHub so that we can discuss publicly.\nAuthor\n\nWebsite: https://markphelps.me\nTwitter: @mark_a_phelps\nEmail: mark.aaron.phelps at gmail.com\n\nContributing\nI would love your help! Before submitting a PR, please read over the Contributing guide.\nPro Version\nMy plan is to soon start working on a Pro Version of Flipt for enterprise. Along with support, some of the planned features include:\n\nUser management/permissions\nMultiple environments\nAudit log\nStreaming updates\nMetrics\nHA support\n\nIf you or your organization would like to help beta test a Pro version of Flipt, please get in touch with me:\n\nTwitter: @mark_a_phelps\nEmail: mark.aaron.phelps at gmail.com\n\n"}]